<!DOCTYPE html>

<html>
<html lang="bn">
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">

<head>
    <title>Cookies || Star</title>
    <style>
        #bar {
            height: 100px;
            background-color: #16b000;
            color: #fff;
            padding: 4px;
            padding-right: 425px;
            border-radius: 4px;
        }

        #signup-button {
            background-color: #5bd043;
            width: 70px;
            text-align: center;
            padding: 4px;
            border-radius: 30px;
            float: right;
        }

        #bar2 {
            background-color: #e9ebee;
            height: 2000px;
            margin-top: 10px;
            padding: 10px;
            
            font-weight: bold;
            border-radius: 4px;
        }

    </style>
</head>

<body style="font-family: times new roman; background-image: url(images/img.jpg);">
    <div id="bar">
        <div style="font-size: 40px;padding-left: 421px;" style="font-family: times new roman;">Star</div>
        <a href="login.php">
            <input type="submit" id="signup-button" value="Login" style="font-family: times new roman;">
        </a>
    </div>
    <div id="bar2">
        <h3 style="text-align: center;">স্টার-এ কীভাবে কুকি নিয়ম<br></h3>
        <h4>কুকি এবং অনুরূপ প্রযুক্তি যেমন পিক্সেল এবং স্থানীয় স্টোরেজ আপনাকে স্টার-এ আরও ভাল, দ্রুত এবং নিরাপদ অভিজ্ঞতা প্রদান করে। কুকিজ আমাদের পরিষেবাগুলি পরিচালনা করতেও ব্যবহার করা হয়, যার মধ্যে আমাদের ওয়েবসাইট, অ্যাপ্লিকেশন, API, পিক্সেল, এম্বেড এবং ইমেল যোগাযোগ রয়েছে। বিশেষত, স্টার এই প্রযুক্তিগুলি ব্যবহার করে:</h4>
            <h4>১. আপনাকে স্টার এ লগ ইন করে রাখুন।<br>
                ২. স্টার পরিষেবাগুলির বৈশিষ্ট্য এবং কার্যকারিতা সরবরাহ করুন।<br>
                ৩. সংরক্ষণ করুন এবং আপনার পছন্দ সম্মান।<br>
                ৪. আপনি যে সামগ্রীটি দেখেন তা ব্যক্তিগতকৃত করুন।<br>
                ৫. স্প্যাম এবং অপব্যবহারের বিরুদ্ধে আপনাকে রক্ষা করুন।<br>
<!--                আপনাকে আরও প্রাসঙ্গিক বিজ্ঞাপন দেখান।-->
                ৬. সদস্যতা বৈশিষ্ট্য প্রদান এবং নির্দিষ্ট বিষয়বস্তু বিতরণ,
                আপনি আমাদের পরিষেবাগুলির সাথে কীভাবে যোগাযোগ করবেন এবং আমরা কোথায় উন্নতি করতে পারি তা বুঝুন।<br>
<!--                আমাদের বিজ্ঞাপন এবং বিপণনের কার্যকারিতা পরিমাপ করুন।-->
                ৭. আমাদের পরিষেবাগুলি কীভাবে কাজ করে তা রেট করুন এবং বাগ এবং অন্যান্য মানের সমস্যাগুলি সনাক্ত করুন৷<br>
                ৮. আমাদের ব্যবসা পরিচালনা করতে ব্যবহৃত ডেটা সংগ্রহ করুন — আমাদের দর্শকের আকার পরিমাপ করা থেকে শুরু করে স্টার নিয়মগুলি প্রয়োগ করা পর্যন্ত।</h4>

            <h4>কুকিজ, পিক্সেল এবং স্থানীয় স্টোরেজ কি?<br><br>

                আপনি যখন ওয়েব ব্রাউজ করেন বা ওয়েব-সক্ষম অ্যাপ ব্যবহার করেন তখন কুকিজ হল আপনার কম্পিউটারে রাখা ছোট ফাইল। আমরা আমাদের পরিষেবাগুলি পরিচালনা করতে কুকিজ ব্যবহার করি, লোকেরা কীভাবে আমাদের পরিষেবাগুলি ব্যবহার করে তা আবিষ্কার করি, কীভাবে তাদের আরও ভালভাবে কাজ করা যায় তা বুঝতে পারি। আমরা কিভাবে কুকিজ ব্যবহার করি তার আরো উদাহরণের জন্য উপরে দেখুন।

                পিক্সেল হল একটি ওয়েব পৃষ্ঠায়, একটি ওয়েব-সক্ষম অ্যাপে বা একটি ইমেলে রাখা অল্প পরিমাণ কোড। আমরা পিক্সেল ব্যবহার করি, যার মধ্যে কিছু আমরা বিজ্ঞাপনদাতাদের তাদের ওয়েব বৈশিষ্ট্যে রাখার জন্য প্রদান করি, আপনি নির্দিষ্ট ওয়েব বা ইমেল বিষয়বস্তুর সাথে ইন্টারঅ্যাক্ট করেছেন কিনা তা জানতে — যেমন অনেক পরিষেবা করে। এটি আমাদের পরিষেবাগুলি পরিমাপ করতে এবং উন্নত করতে এবং আপনি যে বিজ্ঞাপন এবং বিষয়বস্তু দেখেন তা সহ আপনার অভিজ্ঞতাকে ব্যক্তিগতকৃত করতে সহায়তা করে৷

                আমরা আপনার কম্পিউটার বা মোবাইল ডিভাইসে ডেটা সংরক্ষণ করতে স্থানীয় স্টোরেজ ব্যবহার করি। ওয়েব নেভিগেশন চালু করতে, ভিডিও প্লেয়ারের পছন্দগুলি বজায় রাখতে, আমাদের পরিষেবাগুলির সাথে আপনার অতীতের মিথস্ক্রিয়াগুলির উপর ভিত্তি করে আমরা আপনাকে যা দেখাই তা কাস্টমাইজ করতে, আপনার পছন্দগুলি মনে রাখতে এবং বিজ্ঞাপনের কার্যকারিতা পরিমাপ করতে আমরা স্থানীয় স্টোরেজ থেকে ডেটা ব্যবহার করি। আমরা অন্যান্য ওয়েবসাইটে স্থানীয় স্টোরেজ ব্যবহার করতে পারি, যেখানে আপনাকে নির্দিষ্ট বৈশিষ্ট্যগুলি প্রদান করার জন্য প্রয়োজন হয়, সেই সাইটগুলিতে আপনার পরিদর্শন সম্পর্কে তথ্য পেতে।

            </h4>
            <h4> কেন আমাদের পরিষেবাগুলি এই প্রযুক্তিগুলি ব্যবহার করে?<br><br>



                কুকিজ, পিক্সেল, এবং স্থানীয় স্টোরেজ আমাদের ব্যবসা পরিচালনা এবং সমর্থন করার জন্য এবং আপনাকে একটি উন্নত অভিজ্ঞতা প্রদানে সহায়তা করার জন্য কাজ করে। এগুলি নিম্নলিখিত বিভাগগুলিতে ব্যবহৃত হয়:

                প্রমাণীকরণ এবং নিরাপত্তা
                কার্যকারিতা
                ব্যবহারকারীর সুবিধামত
                বিশ্লেষণ
                গবেষণা ও উন্নয়ন
                ব্যক্তিগতকৃত সামগ্রী
                বিজ্ঞাপন
                মার্কেটিং
                ডিভাইস জুড়ে ব্যক্তিগতকরণ</h4>
            <h4>এই প্রতিটি বিভাগের মধ্যে, কুকিজ, পিক্সেল এবং স্থানীয় স্টোরেজ আমাদের সাহায্য করে:

                প্রমাণীকরণ এবং নিরাপত্তা
                আপনাকে প্রাসঙ্গিক বিষয়বস্তু দেখানোর জন্য আপনার স্টার অ্যাক্সেস প্রমাণীকরণ করুন। এগুলি অননুমোদিত পক্ষগুলিকে আপনার অ্যাকাউন্ট অ্যাক্সেস করতে বাধা দিতেও সহায়তা করে৷ আমরা এই প্রযুক্তিগুলি ব্যবহার করি:

                আপনি স্টার এবং আমাদের পরিষেবাগুলিতে লগ ইন করুন৷
                আপনার নিরাপত্তা এবং আমাদের পরিষেবার নিরাপত্তা রক্ষা করতে সাহায্য করুন।
                আপনাকে সীমিত বিতরণ সহ সামগ্রী দেখতে দিন।
                স্প্যাম, অপব্যবহার এবং স্টার নিয়ম ভঙ্গকারী অন্যান্য ক্রিয়াকলাপগুলি সনাক্ত করতে এবং প্রতিরোধ করতে আমাদের সহায়তা করুন৷
                কার্যকারিতা
                ত্রুটির বার্তাগুলি সরবরাহ করুন, আপনাকে অ্যাকাউন্টগুলির মধ্যে স্যুইচ করার অনুমতি দেয়, একটি ব্রাউজারে ট্যাব জুড়ে আমাদের পরিষেবা সমন্বয় করতে এবং অংশীদার ওয়েবসাইটগুলিতে নির্দিষ্ট বৈশিষ্ট্যগুলি প্রদান করে৷

                ব্যবহারকারীর সুবিধামত
                আপনার ব্রাউজার এবং আপনার পছন্দ সম্পর্কে তথ্য মনে রাখবেন।

                বিশ্লেষণ

                বোতাম এবং উইজেট সহ লোকেরা কীভাবে আমাদের পরিষেবাগুলি ব্যবহার করে তা উন্নত করুন এবং বুঝুন৷
                আপনি আমাদের পরিষেবাগুলির সাথে কীভাবে ইন্টারঅ্যাক্ট করেন, যেমন কখন এবং কত ঘন ঘন আপনি সেগুলি ব্যবহার করেন এবং আপনি কোন লিঙ্কগুলিতে যান এবং কোথা থেকে তা বোঝার মাধ্যমে আপনার অভিজ্ঞতা অপ্টিমাইজ করুন৷ (এতে আমাদের সাহায্য করার জন্য আমরা Google Analytics ব্যবহার করতে পারি।)
                একটি নির্দিষ্ট পোস্ট, এম্বেড করা পোস্ট, বোতাম বা টাইমলাইন দেখেছেন এমন লোকের সংখ্যা গণনা করুন। আরও জানুন।
                গবেষণা ও উন্নয়ন

                আপনি আমাদের পরিষেবাগুলি কীভাবে ব্যবহার করেন সে সম্পর্কে ডেটা সংগ্রহ করুন, আমাদের পরিষেবাগুলি কীভাবে কার্য সম্পাদন করে। এটি আমাদের সমস্যা সনাক্ত করতে, আমরা কোথায় উন্নতি করতে পারি বা নতুন পণ্য বা পরিষেবা বিকাশ করতে পারি তা বুঝতে সাহায্য করে।
                স্টার পরিষেবাগুলির আপডেটগুলি পরীক্ষা করুন, সেইসাথে নতুন বৈশিষ্ট্য, কার্যকারিতা এবং পরিষেবাগুলি তৈরি করুন৷
                ব্যক্তিগতকৃত বিষয়বস্তু
                প্রবণতা, গল্প, বিজ্ঞাপন এবং আরও প্রাসঙ্গিক বিষয়বস্তু সহ লোকেদের অনুসরণ করার জন্য পরামর্শের মতো ক্ষেত্রগুলিতে আমাদের পরিষেবাগুলিকে ব্যক্তিগতকৃত করুন৷ এছাড়াও আমরা ব্যবহার করি:

                আপনার স্টার টাইমলাইনের কোন অংশ আপনি ইতিমধ্যে দেখেছেন তা আমাদের জানাতে স্থানীয় স্টোরেজ যাতে আমরা আপনাকে নতুন সামগ্রী দেখাতে পারি।
                সমন্বিত স্টার পরিষেবা সহ ওয়েবসাইটগুলিতে আপনার পরিদর্শনের উপর ভিত্তি করে আপনি কাকে অনুসরণ করতে পারেন তা পরামর্শ দেওয়ার জন্য কুকিজ৷
                বিজ্ঞাপন
                বিজ্ঞাপনগুলিকে ব্যক্তিগতকৃত করুন এবং কর্মক্ষমতা পরিমাপ করুন, যেমন আপনাকে বিজ্ঞাপন দেখানো এবং আমাদের বিজ্ঞাপন অংশীদারদের ওয়েবসাইটে আপনার পরিদর্শনের উপর ভিত্তি করে তাদের কার্যকারিতা মূল্যায়ন করা। এটি বিজ্ঞাপনদাতাদের আপনাকে উচ্চ-মানের বিজ্ঞাপন এবং সামগ্রী প্রদান করতে সাহায্য করে যা আপনার কাছে আরও আকর্ষণীয় হতে পারে। ভাল এছাড়াও: </h4>
            <h4>বিজ্ঞাপনগুলি সরবরাহ করুন, তাদের কর্মক্ষমতা পরিমাপ করুন এবং মানদণ্ডের উপর ভিত্তি করে সেগুলিকে আপনার কাছে আরও প্রাসঙ্গিক করে তুলুন, যেমন স্টার-এ আপনার কার্যকলাপ এবং আমাদের বিজ্ঞাপন অংশীদারদের ওয়েবসাইট পরিদর্শন৷
                আমাদের পরিষেবাগুলি বাজারজাত করতে Google সহ তৃতীয় পক্ষের বিজ্ঞাপন অংশীদারদের সাথে কাজ করুন৷
                মার্কেটিং
                আমাদের ইমেল এবং ওয়েব বিপণন প্রচারাভিযান বিতরণ এবং আমাদের বিপণন কার্যকারিতা বুঝতে.

                ডিভাইস জুড়ে ব্যক্তিগতকরণ
                আপনি কোন ডিভাইসগুলি ব্যবহার করেছেন তা বুঝুন যাতে আমরা আপনার সমস্ত ডিভাইসে আপনার অভিজ্ঞতা ব্যক্তিগতকৃত করতে পারি।

                মনে রাখবেন, আপনি যদি কখনও আপনার ডিভাইসের সাথে স্টার এ লগ ইন করেন, আমরা সেই ডিভাইসটিকে আপনার অ্যাকাউন্টের সাথে সংযুক্ত করব এবং চালিয়ে যাব। এর অর্থ হল আপনি লগ ইন করুন বা না করুন, আমরা আপনার ডিভাইস(গুলি) সম্পর্কে তথ্য পাব যখন কোনো অংশীদার দ্বারা তথ্য ভাগ করা হয়, আপনি Star.com বা তৃতীয় পক্ষের ওয়েবসাইটগুলি যান যা স্টার পরিষেবাগুলিকে একীভূত করে, বা আপনি একটি স্টার পরিদর্শন করেন বিজ্ঞাপনদাতার ওয়েবসাইট বা মোবাইল অ্যাপ্লিকেশন। সাধারণত, আইপি ঠিকানা এবং আমরা যে সময় ডেটা গ্রহণ করি, সেই নির্দিষ্ট ডিভাইসটিকে আপনার সাথে লিঙ্ক করতে ব্যবহৃত হয়।

                আপনার স্টার অ্যাকাউন্টের সাথে যুক্ত ডিভাইস এবং ওয়েব ব্রাউজার সম্পর্কে আরও দেখতে, আপনি যখন লগ ইন করবেন এবং যখন আপনি আপনার অ্যাকাউন্ট থেকে লগ আউট করবেন তখন আপনার X ডেটা দেখুন।


                এই প্রযুক্তি কোথায় ব্যবহার করা হয়?

                আমরা (তৃতীয় পক্ষের সাথে) স্টার পরিষেবাগুলিতে এই প্রযুক্তিগুলি ব্যবহার করি, যার মধ্যে রয়েছে আমাদের ওয়েবসাইট, অ্যাপ্লিকেশন, এবং পরিষেবাগুলি এবং অন্যান্য ওয়েবসাইট, অ্যাপ্লিকেশন এবং পরিষেবাগুলিতে যেগুলি X পরিষেবাগুলিকে একীভূত করেছে, তৃতীয় পক্ষের বৈশিষ্ট্যগুলি সহ যা আমাদের বিজ্ঞাপন প্রযুক্তিকে অন্তর্ভুক্ত করে৷ এতে আমাদের বিজ্ঞাপন অংশীদারদের ওয়েবসাইট এবং সাইটগুলি অন্তর্ভুক্ত রয়েছে যেগুলি এম্বেড করা টাইমলাইন সহ আমাদের এম্বেডগুলি ব্যবহার করে৷ তৃতীয় পক্ষগুলিও এই প্রযুক্তিগুলি ব্যবহার করতে পারে, উদাহরণস্বরূপ, আপনি যখন X পরিষেবাগুলির লিঙ্কগুলিতে ক্লিক করেন, X পরিষেবাগুলিতে তৃতীয়-পক্ষের বিষয়বস্তু দেখেন বা ইন্টারঅ্যাক্ট করেন বা আমাদের বিজ্ঞাপন প্রযুক্তি অন্তর্ভুক্ত করে এমন তৃতীয় পক্ষের ওয়েবসাইটগুলিতে যান৷ </h4>
            <h4>বিজ্ঞাপনগুলি সরবরাহ করুন, তাদের কর্মক্ষমতা পরিমাপ করুন এবং মানদণ্ডের উপর ভিত্তি করে সেগুলিকে আপনার কাছে আরও প্রাসঙ্গিক করে তুলুন, যেমন X-এ আপনার কার্যকলাপ এবং আমাদের বিজ্ঞাপন অংশীদারদের ওয়েবসাইট পরিদর্শন৷
                আমাদের পরিষেবাগুলি বাজারজাত করতে Google সহ তৃতীয় পক্ষের বিজ্ঞাপন অংশীদারদের সাথে কাজ করুন৷
                মার্কেটিং
                আমাদের ইমেল এবং ওয়েব বিপণন প্রচারাভিযান বিতরণ এবং আমাদের বিপণন কার্যকারিতা বুঝতে.

                ডিভাইস জুড়ে ব্যক্তিগতকরণ
                আপনি কোন ডিভাইসগুলি ব্যবহার করেছেন তা বুঝুন যাতে আমরা আপনার সমস্ত ডিভাইসে আপনার অভিজ্ঞতা ব্যক্তিগতকৃত করতে পারি।

                মনে রাখবেন, আপনি যদি কখনও আপনার ডিভাইসের সাথে X এ লগ ইন করেন, আমরা সেই ডিভাইসটিকে আপনার অ্যাকাউন্টের সাথে সংযুক্ত করব এবং চালিয়ে যাব। এর অর্থ হল আপনি লগ ইন করুন বা না করুন, আমরা আপনার ডিভাইস(গুলি) সম্পর্কে তথ্য পাব যখন কোনো অংশীদার দ্বারা তথ্য ভাগ করা হয়, আপনি twitter.com বা তৃতীয় পক্ষের ওয়েবসাইটগুলি যান যা X পরিষেবাগুলিকে একীভূত করে, বা আপনি একটি X পরিদর্শন করেন বিজ্ঞাপনদাতার ওয়েবসাইট বা মোবাইল অ্যাপ্লিকেশন। সাধারণত, আইপি ঠিকানা এবং আমরা যে সময় ডেটা গ্রহণ করি, সেই নির্দিষ্ট ডিভাইসটিকে আপনার সাথে লিঙ্ক করতে ব্যবহৃত হয়।

                আপনার X অ্যাকাউন্টের সাথে যুক্ত ডিভাইস এবং ওয়েব ব্রাউজার সম্পর্কে আরও দেখতে, আপনি যখন লগ ইন করবেন এবং যখন আপনি আপনার অ্যাকাউন্ট থেকে লগ আউট করবেন তখন আপনার X ডেটা দেখুন।


                এই প্রযুক্তি কোথায় ব্যবহার করা হয়?

                আমরা (তৃতীয় পক্ষের সাথে) স্টার পরিষেবাগুলিতে এই প্রযুক্তিগুলি ব্যবহার করি, যার মধ্যে রয়েছে আমাদের ওয়েবসাইট, অ্যাপ্লিকেশন, এবং পরিষেবাগুলি এবং অন্যান্য ওয়েবসাইট, অ্যাপ্লিকেশন এবং পরিষেবাগুলিতে যেগুলি X পরিষেবাগুলিকে একীভূত করেছে, তৃতীয় পক্ষের বৈশিষ্ট্যগুলি সহ যা আমাদের বিজ্ঞাপন প্রযুক্তিকে অন্তর্ভুক্ত করে৷ এতে আমাদের বিজ্ঞাপন অংশীদারদের ওয়েবসাইট এবং সাইটগুলি অন্তর্ভুক্ত রয়েছে যেগুলি এম্বেড করা টাইমলাইন সহ আমাদের এম্বেডগুলি ব্যবহার করে৷ তৃতীয় পক্ষগুলিও এই প্রযুক্তিগুলি ব্যবহার করতে পারে, উদাহরণস্বরূপ, আপনি যখন X পরিষেবাগুলির লিঙ্কগুলিতে ক্লিক করেন, X পরিষেবাগুলিতে তৃতীয়-পক্ষের বিষয়বস্তু দেখেন বা ইন্টারঅ্যাক্ট করেন বা আমাদের বিজ্ঞাপন প্রযুক্তি অন্তর্ভুক্ত করে এমন তৃতীয় পক্ষের ওয়েবসাইটগুলিতে যান৷ </h4>
            <h4>আমার গোপনীয়তা বিকল্প কি?

                আমরা, আমাদের অংশীদাররা এবং অন্যান্য তৃতীয়-পক্ষ কীভাবে কুকি এবং কুকি-সম্পর্কিত ডেটা ব্যবহার করি তা নিয়ন্ত্রণ বা সীমিত করতে আমরা আপনাকে অর্থপূর্ণ গোপনীয়তার বিকল্প দিতে প্রতিশ্রুতিবদ্ধ:

                স্টার অন্যান্য ওয়েবসাইটগুলির তথ্য সঞ্চয় করে যেখানে আপনি X সামগ্রী দেখেছেন বা আমাদের পরিষেবাগুলি অ্যাক্সেস করেছেন৷ বেশিরভাগ X বৈশিষ্ট্যের জন্য আপনি এটিতে গিয়ে সামঞ্জস্য করতে পারেন: সেটিংস এবং গোপনীয়তা > গোপনীয়তা এবং নিরাপত্তা > অফ-এক্স কার্যকলাপ > আপনি যেখানে ওয়েব জুড়ে X সামগ্রী দেখতে পান সেখানে ব্যবহারের অনুমতি দিন৷ যাইহোক, নির্দিষ্ট অর্থপ্রদানের সাবস্ক্রিপশন বৈশিষ্ট্যগুলির জন্য, এমনকি যদি আপনি এই সমন্বয়টি করেন তবে আমরা এখনও নির্দিষ্ট তথ্য সংরক্ষণ করব যেখানে এটি করা সেই বৈশিষ্ট্যটি কাজ করার জন্য প্রয়োজনীয়। আপনি যখন এই বৈশিষ্ট্যগুলির জন্য সাইন আপ করবেন তখন আমরা আপনাকে এই স্টোরেজ সম্পর্কে বলব৷

                আপনি যদি এটি বন্ধ করে থাকেন, বা ইইউ, আইসল্যান্ড, লিচেনস্টাইন, নরওয়ে বা সুইজারল্যান্ডে থাকেন, তাহলে ভবিষ্যতে আপনার অভিজ্ঞতা উন্নত করতে আমরা এই ওয়েব পৃষ্ঠা পরিদর্শনগুলি সংরক্ষণ বা ব্যবহার করব না। যাইহোক, যদি আমরা আগে আপনার ওয়েব ব্রাউজিং ইতিহাস সংরক্ষণ করে থাকি, তাহলে আমরা সেই ইতিহাস থেকে ইতিমধ্যেই শিখেছি এমন তথ্যের উপর ভিত্তি করে আপনার অভিজ্ঞতা ব্যক্তিগতকৃত করা চালিয়ে যেতে পারি।

                আপনি সবসময় আপনার X কার্যকলাপের উপর ভিত্তি করে X-এ বিজ্ঞাপন দেখতে পাবেন। বিজ্ঞাপনের জন্য X যেভাবে আপনার ডেটা ব্যবহার করে তা সামঞ্জস্য করার বিভিন্ন উপায় রয়েছে৷ আপনি নিম্নলিখিত সরঞ্জাম ব্যবহার করতে পারেন:

                X-এ ব্যক্তিগতকৃত বিজ্ঞাপন সেটিং
                সেটিংস এবং গোপনীয়তা > গোপনীয়তা এবং নিরাপত্তা > বিজ্ঞাপনের পছন্দ > ব্যক্তিগতকৃত বিজ্ঞাপনে গিয়ে অফ-এক্স ডেটা ব্যবহারের জন্য আপনার সেটিং সামঞ্জস্য করুন।
                ওয়েবের জন্য আগ্রহ-ভিত্তিক বিজ্ঞাপন
                optout.aboutads.info-এ ডিজিটাল অ্যাডভারটাইজিং অ্যালায়েন্সের ভোক্তা পছন্দ টুলের মাধ্যমে আপনার বর্তমান ব্রাউজারে অপ্ট-আউট করুন৷
                iOS সংস্করণ 13 এবং তার আগের জন্য বিজ্ঞাপন ট্র্যাকিং সীমাবদ্ধ করুন
                আপনার iOS ডিভাইস সেটিংসের মাধ্যমে এই সেটিংটি চালু করুন (সুনির্দিষ্ট নির্দেশাবলী সংস্করণ অনুসারে পরিবর্তিত হয়)।
                অ্যান্ড্রয়েডের জন্য বিজ্ঞাপন ব্যক্তিগতকরণ
                আপনার ডিভাইস সেটিংসের মাধ্যমে অপ্ট আউট করুন (সুনির্দিষ্ট নির্দেশাবলী সংস্করণ অনুসারে পরিবর্তিত হয়)।
                অ্যাপগুলিকে iOS সংস্করণ 14 এবং পরবর্তী সংস্করণের জন্য ট্র্যাক করার অনুরোধ করার অনুমতি দিন
                আপনার ডিভাইস সেটিংসের মাধ্যমে সেটিংটি বন্ধ করুন (সুনির্দিষ্ট নির্দেশাবলী সংস্করণ অনুসারে পরিবর্তিত হয়)।
                X এ আপনার অনুমানকৃত পরিচয় সেটিং এর উপর ভিত্তি করে ব্যক্তিগতকৃত করুন
                সেটিংস এবং গোপনীয়তা > গোপনীয়তা এবং নিরাপত্তা > অফ-এক্স কার্যকলাপ > আপনার অনুমানকৃত পরিচয়ের উপর ভিত্তি করে ব্যক্তিগতকরণে গিয়ে সেটিং সামঞ্জস্য করুন। আপনি X লগ ইন করতে যে ব্রাউজার বা ডিভাইসগুলি ব্যবহার করেন সেগুলি ছাড়া আমরা আপনার অ্যাকাউন্টকে অন্য ব্রাউজার বা ডিভাইসের সাথে লিঙ্ক করব কিনা এটি নিয়ন্ত্রণ করে (অথবা আপনি লগ আউট হয়ে থাকলে, আপনি বর্তমানে যে ব্রাউজার বা ডিভাইসটি ব্যবহার করছেন তা আমরা অন্য কোনো ব্রাউজার বা ডিভাইসের সাথে লিঙ্ক করব কিনা)।
                ওয়েব ব্রাউজারের মাধ্যমে কুকি সেটিংস
                বেশিরভাগ ব্রাউজার কুকি ব্যবহার করার জন্য আপনার অনুমতির অনুরোধ করবে। মনে রাখবেন যে আপনি যদি কুকিজ সম্পূর্ণরূপে বন্ধ করে দেন, X পরিষেবাগুলি সঠিকভাবে কাজ নাও করতে পারে বা twitter.com-এ লগ ইন করতে আপনার সমস্যা হতে পারে। </h4>
            <h4>আরও গোপনীয়তার বিকল্প

                optout.aboutads.info-এর পাশাপাশি, আপনি networkadvertising.org/choices-এ আগ্রহ-ভিত্তিক বিজ্ঞাপনগুলি অপ্ট আউট করার বিষয়ে আরও পড়তে পারেন৷ অবশেষে, আপনি Google-এর বিজ্ঞাপন সেটিংস ব্যবহার করে আগ্রহ-ভিত্তিক Google বিজ্ঞাপনগুলি অপ্ট-আউট করতে পারেন৷

                গুরুত্বপূর্ণ: আপনার X অ্যাকাউন্টের ওয়েব সেটিংস দেখতে বা পরিবর্তন করতে, আপনাকে ওয়েব ব্রাউজারে লগ ইন করতে হবে। আপনি লগ আউট করার সময় ওয়েব ব্রাউজারে আপনার X সেটিংস পরিবর্তন করা শুধুমাত্র সেই ব্রাউজারে আচরণকে প্রভাবিত করবে যখন আপনি X-তে লগ ইন করবেন না৷ আরও জানতে কীভাবে আপনার ব্যক্তিগতকরণ এবং ডেটা সেটিংস অ্যাক্সেস করবেন সে সম্পর্কে আমাদের নিবন্ধটি পড়ুন৷ </h4>
            <h4>আপনি যে কুকিগুলির মুখোমুখি হন তা নির্ভর করে আপনার ব্যবহার করা বৈশিষ্ট্য এবং কার্যকারিতার উপর। X পরিষেবাগুলিতে সর্বাধিক ব্যবহৃত কুকিগুলি এই চার্টে বর্ণনা করা হয়েছে, যা আমরা সময়ে সময়ে আপডেট করি। কিছু নির্দিষ্ট এলাকায় কুকির আয়ুষ্কাল 13 মাসের মধ্যে সীমাবদ্ধ। </h4>
            <h4> </h4>
    </div>
</body>

</html>
