<?php 

include"classes/autoload.php";

$login = new Login();
$user_data = $login->check_login($_SESSION['star_userid']);

$USER = $user_data;

if(isset($_GET['id']) && is_numeric($_GET['id'])){

    $profile = new Profile();
    $profile_data = $profile->get_profile($_GET['id']);

   if(is_array($profile_data)){
    $user_data = $profile_data[0];
  }
}

?>

<!DOCTYPE html>
<html>
<html lang="bn">
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">

<head>
    <title>Privacy policy || Star</title>
    <style>
        #bar {
            height: 100px;
            background-color: #16b000;
            color: #fff;
            padding: 4px;
            padding-right: 425px;
            border-radius: 4px;
        }

        #button {
            background-color: #5bd043;
            width: 70px;
            text-align: center;
            padding: 4px;
            border-radius: 30px;
            float: right;
        }

        #bar2 {
            background-color: #e9ebee;
            height: 1000px;
            margin-top: 10px;
            padding: 10px;
            text-align: center;
            font-weight: bold;
            border-radius: 4px;
        }

    </style>
</head>

<body style="font-family: times new roman; background-image: url(images/img.jpg);">
    <div id="bar">
        <div style="font-size: 40px;padding-left: 421px;" style="font-family: times new roman;"><a href="login.php" style="text-decoration: none; color:white;">Star</a></div>
        <a href="index.php">
            <input type="submit" id="button" value="Back to Star" style="font-family: times new roman;width: 100px;">
        </a>
    </div>
    <div id="bar2">
        <div style="font-family: times new roman; background-color: #d0d8e4; padding-left:60px; padding-top:60px;">
            <div style=" text-align: left;">

            <h2 style="text-align: center;">গোপনীয়তা নীতি</h2>
            <h4 style="">স্টারের গোপনীয়তা নীতিতে আপনাকে স্বাগতম।<br><br>
                    স্টার সামাজিক যোগাযোগ মাধ্যমে মেধা বিকাশে গুরুত্বপূর্ণ ভূমিকা রাখবে।<br>
                    সামাজিক যোগাযোগ মাধ্যম হিসেবে স্টার বাংলাদেশে প্রথম স্টার সামাজিক যোগাযোগ চালু করে।<br>
                    স্টার প্রতিটি দেশের আইন ও নীতিকে সম্মান রেখে, আমরা স্টারের গোপনীয়তা নীতি লিখেছি যাতে আপনি স্টার ব্যবহার করার সময় তথ্যগত সিদ্ধান্ত নিতে আপনাকে ক্ষমতায়ন করতে পারেন যাতে আমরা যে তথ্য সংগ্রহ করি, কীভাবে এটি ব্যবহার করা হয় এবং কখন শেয়ার করা হয় তার উপর আপনি বোঝেন এবং নিয়ন্ত্রণ করেন তা নিশ্চিত করে। আপনি স্টারের গোপনীয়তা নীতিতে চুক্তিবদ্ধ আছেন এবং গোপনীয়তা নীতির প্রতিটি শব্দ পড়া এড়িয়ে যান, অন্তত এটি জানুন:</h4>
                
                    স্টার প্রোফাইলে আপনার নিজের ছবি,সংগঠনের লোগো এবং প্রতিষ্ঠানের পতাকা ব্যবহার করে স্টার প্রোফাইল তৈরি করুন।<br>
                    <h4>আপনি স্টারের সম্পর্কে কি তথ্য সংগ্রহ করেন?<br>
                    আপনি কিছু ডেটা দেন, আমরা কিছু ডেটা পাই। বিনিময়ে আমরা দরকারী পরিষেবা অফার করি।                    
                    <br><br>
                    1. তথ্য আমরা সংগ্রহ করি
                    আপনি যখন স্টার ব্যবহার করেন তখন আমরা যে তথ্য সংগ্রহ করি তা তিনটি বিভাগে পড়ে।
                    <br>

                    1.1 তথ্য আপনি আমাদের প্রদান,<br>
                    আপনি স্টার সাইন আপের তথ্য প্রদান করেছেন মানে, সামাজিক যোগাযোগ মাধ্যমের সাথে আছেন। এগিয়ে যান, আমাদের কিছু পণ্য এবং পরিষেবা ব্যবহার করার জন্য আপনার একটি অ্যাকাউন্ট থাকতে হবে এবং একটি অ্যাকাউন্ট তৈরি করতে, আপনাকে আমাদের নির্দিষ্ট তথ্য প্রদান করতে হবে। একইভাবে, আপনি যদি আমাদের অর্থপ্রদানের পণ্য এবং পরিষেবাগুলি ব্যবহার করেন, আমরা অর্থপ্রদানের তথ্য না পেয়ে আপনাকে সেগুলি সরবরাহ করতে বলতে পারি না। মূলত, আপনি যদি আমাদের অনেক পণ্য এবং পরিষেবা ব্যবহার করতে চান তবে নির্দিষ্ট তথ্য প্রয়োজন৷
                    ব্যক্তিগত অ্যাকাউন্ট। আপনি যদি একটি অ্যাকাউন্ট তৈরি করেন, তাহলে আপনাকে অবশ্যই আমাদের কিছু তথ্য প্রদান করতে হবে যাতে আমরা আপনাকে আমাদের পরিষেবা প্রদান করতে পারি। এর মধ্যে একটি প্রদর্শন নাম রয়েছে (উদাহরণস্বরূপ, "স্টার"); একটি ব্যবহারকারীর নাম; একটি পাসওয়ার্ড; একটি ইমেল ঠিকানা বা ফোন নম্বর
                    <!-- জন্ম তারিখ; আপনার প্রদর্শন ভাষা;  -->
                    এবং তৃতীয় পক্ষের একক সাইন-ইন তথ্য (যদি আপনি এই সাইন-ইন পদ্ধতিটি বেছে নেন)।
                    আপনি আপনার প্রোফাইল এবং পোস্টগুলিতে আপনার অবস্থান ভাগ করতে এবং আপনার পরিচিত ব্যক্তিদের খুঁজে পেতে সহায়তা করার জন্য আপনার ঠিকানা পুস্তিকা স্টার এ আপলোড করতেও চয়ন করতে পারেন৷ আপনার প্রোফাইল তথ্য, যার মধ্যে আপনার প্রদর্শন নাম এবং ব্যবহারকারীর নাম রয়েছে, সর্বদা সর্বজনীন, তবে আপনি আপনার সম্পূর্ণ নাম ব্যবহার করতে পারেন।
                   <!-- প্রফেশনাল অ্যাকাউন্ট। 
                        আপনি যদি একটি পেশাদার অ্যাকাউন্ট তৈরি করেন, তবে আপনাকে আমাদের একটি পেশাদার বিভাগ প্রদান করতে হবে এবং রাস্তার ঠিকানা, যোগাযোগের ইমেল ঠিকানা এবং যোগাযোগের ফোন নম্বর সহ আমাদের অন্যান্য তথ্য সরবরাহ করতে পারে, যেগুলি সর্বদা সর্বজনীন থাকবে৷
                    পেমেন্ট তথ্য. আমাদের প্রদত্ত পণ্য এবং পরিষেবার অংশ হিসাবে প্রদত্ত বিজ্ঞাপন বা অন্যান্য অফার কেনার জন্য আপনাকে আপনার ক্রেডিট বা ডেবিট কার্ড নম্বর, কার্ডের মেয়াদ শেষ হওয়ার তারিখ, CVV কোড এবং বিলিং ঠিকানা সহ আমাদের অর্থপ্রদানের তথ্য সরবরাহ করতে হবে।
                    পছন্দসমূহ যখন আপনি আপনার সেটিংস ব্যবহার করে আপনার পছন্দগুলি সেট করেন, আমরা সেই তথ্য সংগ্রহ করি যাতে আমরা আপনার পছন্দগুলিকে সম্মান করতে পারি৷ -->
                </h4>
                <h4>1.2 যখন আপনি স্টার ব্যবহার করেন তখন আমরা তথ্য সংগ্রহ করি।<br>
                    কেন্দ্রে স্টার লোগো সহ 
                    <!-- সবুজ ইন্টারলকিং -->
                    গিয়ারের একটি ত্রয়ী, অবস্থান পিন এবং কুকির মতো বিভিন্ন ধরনের তথ্য দ্বারা বেষ্টিত।
                    আপনি যখন আমাদের পরিষেবাগুলি ব্যবহার করেন, তখন আপনি কীভাবে আমাদের পণ্য এবং পরিষেবাগুলি ব্যবহার করেন সে সম্পর্কে আমরা তথ্য সংগ্রহ করি। আমরা সেই তথ্যটি ব্যবহার করি আপনাকে পণ্য ও পরিষেবা প্রদান করতে, স্টার কে সকলের জন্য আরও সুরক্ষিত এবং সম্মানজনক রাখতে এবং আপনার জন্য আরও প্রাসঙ্গিক রাখতে।
                    ব্যবহারের তথ্য: আমরা স্টার এ আপনার কার্যকলাপ সম্পর্কে তথ্য সংগ্রহ করি, যার মধ্যে রয়েছে:

                    পোস্ট এবং আপনার পোস্ট করা অন্যান্য বিষয়বস্তু (তারিখ, অ্যাপ্লিকেশন, এবং স্টার এর সংস্করণ সহ) এবং আপনার সম্প্রচার কার্যকলাপ সম্পর্কে তথ্য (যেমন, পোস্ট), আপনার তৈরি করা সম্প্রচার সহ এবং আপনি যখন সেগুলি তৈরি করেছেন, আপনার তালিকা, বুকমার্ক এবং সম্প্রদায়গুলি এর একটি অংশ।
                    <!-- অন্যান্য ব্যবহারকারীদের বিষয়বস্তুর সাথে আপনার ইন্টারঅ্যাকশন, যেমন পুনঃপোস্ট, লাইক, বুকমার্ক, শেয়ার, উত্তর, যদি অন্য ব্যবহারকারীরা আপনাকে বিষয়বস্তুতে উল্লেখ করে বা ট্যাগ করে অথবা আপনি উল্লেখ করেন বা ট্যাগ করেন, এবং আপনি যে সম্প্রচারে অংশগ্রহণ করেছেন (আপনার দেখার ইতিহাস সহ, শোনা, মন্তব্য করা, কথা বলা এবং প্রতিক্রিয়া করা)। -->
                    আপনি কীভাবে প্ল্যাটফর্মে অন্যদের সাথে ইন্টারঅ্যাক্ট করেন, যেমন আপনি অনুসরণ করেন এবং যারা আপনাকে অনুসরণ করেন, এনক্রিপ্ট করা বার্তাগুলির সাথে সম্পর্কিত মেটাডেটা এবং আপনি যখন সরাসরি বার্তাগুলি ব্যবহার করেন, বার্তাগুলির বিষয়বস্তু, প্রাপক এবং বার্তাগুলির তারিখ ও সময় সহ।
                    আপনি যদি আমাদের সাথে যোগাযোগ করেন, যেমন ইমেলের মাধ্যমে, আমরা যোগাযোগ এবং এর বিষয়বস্তু সম্পর্কে তথ্য সংগ্রহ করব।
                    আপনি আমাদের পরিষেবা জুড়ে যে লিঙ্কগুলির সাথে ইন্টারঅ্যাক্ট করেন সেগুলির তথ্য আমরা সংগ্রহ করি (আমাদের পাঠানো ইমেলগুলি সহ)।<br>
                    ক্রয় এবং অর্থপ্রদান: একটি মধ্যস্থতাকারীর মাধ্যমে সহ স্টার বৈশিষ্ট্য বা পরিষেবাগুলি ব্যবহার করে আপনাকে অর্থপ্রদান বা অর্থ পাঠানোর অনুমতি দেওয়ার জন্য, আমরা আপনার লেনদেন সম্পর্কে তথ্য পেতে পারি যেমন এটি কখন করা হয়েছিল, কখন একটি সাবস্ক্রিপশনের মেয়াদ শেষ হয় বা স্বয়ংক্রিয়ভাবে পুনর্নবীকরণ করা হয় এবং অর্থ প্রদান করা হয় বা প্রাপ্ত।

                    যন্ত্রের তথ্য: আমরা স্টার অ্যাক্সেস করার জন্য আপনি যে ডিভাইসগুলি ব্যবহার করেন তা থেকে এবং সেগুলি সম্পর্কে তথ্য সংগ্রহ করি, যার মধ্যে রয়েছে:

                    আপনার সংযোগ সম্পর্কে তথ্য, যেমন আপনার আইপি(IP) ঠিকানা, ব্রাউজারের ধরন এবং সম্পর্কিত তথ্য।<br><br>

                    <!-- এই বিষয় ‍কি?? -->
                    আপনার ডিভাইস এবং এর সেটিংস সম্পর্কে তথ্য, যেমন ডিভাইস এবং বিজ্ঞাপন আইডি, অপারেটিং সিস্টেম, ক্যারিয়ার, ভাষা, মেমরি, ইনস্টল করা অ্যাপ এবং ব্যাটারি স্তর।
                    আপনার ডিভাইসের ঠিকানা বই, যদি আপনি এটি আমাদের সাথে শেয়ার করতে বেছে নেন।<br><br>

                    <!-- এই বিষয় ‍কি?? -->
                    কমলা এবং ধূসর অবস্থানের পিনের চারপাশে ছড়িয়ে ছিটিয়ে থাকা একটি সেল ফোনের স্ক্রিন গ্লোবে জ্বলজ্বল করছে।<br><br>
                    অবস্থানগত তথ্য: যখন আপনি স্টার ব্যবহার করেন, আমরা আপনাকে প্রাসঙ্গিক বিজ্ঞাপন দেখানো সহ আপনার প্রত্যাশিত পরিষেবা প্রদানের জন্য আপনার আনুমানিক অবস্থান সম্পর্কে কিছু তথ্য সংগ্রহ করি। আপনি আপনার অ্যাকাউন্টে এই সেটিংস সক্ষম করে আপনার বর্তমান সুনির্দিষ্ট অবস্থান বা স্থানগুলি যেখানে আপনি পূর্বে স্টার ব্যবহার করেছেন সেগুলি ভাগ করতেও চয়ন করতে পারেন৷

                    অনুমিত পরিচয়: আমরা এমন তথ্য সংগ্রহ বা গ্রহণ করতে পারি যা আমরা আপনার পরিচয় অনুমান করার জন্য ব্যবহার করি নীচে বিশদভাবে:
                    আপনি যখন কোনো ব্রাউজার বা ডিভাইসে স্টার সাইন ইন করবেন, তখন আমরা সেই ব্রাউজার বা ডিভাইসটিকে আপনার অ্যাকাউন্টের সাথে সংযুক্ত করব। আপনার সেটিংস সাপেক্ষে, আমরা আপনার অ্যাকাউন্টকে স্টার-এ সাইন ইন করতে ব্যবহার করা ছাড়া অন্য ব্রাউজার বা ডিভাইসগুলির সাথেও যুক্ত করতে পারি (অথবা আপনার সাইন-আউট করা ডিভাইস বা ব্রাউজারকে অন্যান্য ব্রাউজার বা ডিভাইস বা স্টার-জেনারেটেড শনাক্তকারীর সাথে সংযুক্ত করতে পারি)।
                    যখন আপনি স্টার-কে একটি ইমেল ঠিকানা বা ফোন নম্বর সহ অন্যান্য তথ্য প্রদান করেন, তখন আমরা সেই তথ্যটি আপনার স্টার অ্যাকাউন্টের সাথে যুক্ত করি। আপনার সেটিংস সাপেক্ষে, আমরা আপনার পরিচয় সম্পর্কে অন্যান্য তথ্য অনুমান করার জন্য এই তথ্যটি ব্যবহার করতে পারি, 
                    
                    <!-- উদাহরণস্বরূপ, আপনার অ্যাকাউন্টকে ইমেল ঠিকানাগুলির হ্যাশের সাথে সংযুক্ত করে যা আপনি স্টার-কে দেওয়া ইমেল ঠিকানার সাথে সাধারণ উপাদানগুলি ভাগ করে। -->
                    আপনি যখন স্টার অ্যাক্সেস করেন এবং সাইন ইন করেন না, তখন আমরা সংগ্রহ করা তথ্যের উপর ভিত্তি করে আপনার পরিচয় অনুমান করতে পারি।
                    একটি ল্যাপটপ এবং সেল ফোন বিভিন্ন ধরনের তথ্যের প্রতিনিধিত্বকারী আইকনগুলির পাশাপাশি কম্পিউটার কোডের স্ক্রীন দেখায়৷
                    লগ ইনফরমেশন। আপনি যখন আমাদের পণ্য এবং পরিষেবাগুলিতে সামগ্রী দেখেন বা অন্যথায় যোগাযোগ করেন তখন আমরা তথ্য পেতে পারি, এমনকি যদি আপনি একটি অ্যাকাউন্ট তৈরি না করেন বা সাইন আউট করেন, যেমন:

                    আইপি ঠিকানা এবং সম্পর্কিত তথ্য; ব্রাউজারের ধরন এবং ভাষা; অপারেটিং সিস্টেম; উল্লেখ করা ওয়েবপৃষ্ঠা; অ্যাক্সেস সময়; পরিদর্শন করা পৃষ্ঠাগুলি; অবস্থান; আপনার মোবাইল ক্যারিয়ার; ডিভাইস তথ্য (ডিভাইস এবং অ্যাপ্লিকেশন আইডি সহ); অনুসন্ধান পদ এবং আইডি (কোয়েরি হিসাবে জমা দেওয়া হয়নি সেগুলি সহ); স্টার এ আপনাকে দেখানো বিজ্ঞাপনগুলি; স্টার-জেনারেটেড শনাক্তকারী; এবং কুকিজের সাথে যুক্ত শনাক্তকারী। আপনি যখন স্টার-এর মাধ্যমে অন্য অ্যাপ্লিকেশন ইনস্টল করেন তখন সহ আপনি যখন আমাদের পরিষেবার লিঙ্কগুলিতে ক্লিক করেন, দেখেন বা ইন্টারঅ্যাক্ট করেন তখন আমরা লগ তথ্যও পাই।</h4>
                <h4>1.3 তথ্য আমরা তৃতীয় পক্ষ থেকে প্রাপ্ত,

                    আপনি যখন অন্যান্য অনলাইন পণ্য এবং পরিষেবাগুলি ব্যবহার করেন, তখন তারা সেই ব্যবহার সম্পর্কে তথ্য আমাদের সাথে শেয়ার করতে পারে।

                    বিজ্ঞাপন অংশীদার, বিকাশকারী, প্রকাশক। আমাদের বিজ্ঞাপন এবং ব্যবসায়িক অংশীদাররা আমাদের সাথে তথ্য শেয়ার করে যেমন ব্রাউজার কুকি আইডি, স্টার-জেনারেটেড শনাক্তকারী, মোবাইল ডিভাইস আইডি, হ্যাশ করা ব্যবহারকারীর তথ্য যেমন ইমেল ঠিকানা, ডেমোগ্রাফিক বা আগ্রহের ডেটা এবং ওয়েবসাইট বা অ্যাপে দেখা বা গৃহীত বিষয়বস্তু। আমাদের কিছু বিজ্ঞাপন অংশীদার, বিশেষ করে আমাদের বিজ্ঞাপনদাতারাও আমাদের বিজ্ঞাপন প্রযুক্তিকে একীভূত করে সরাসরি তাদের ওয়েবসাইট বা অ্যাপ থেকে অনুরূপ তথ্য সংগ্রহ করতে সক্ষম করে। বিজ্ঞাপন অংশীদার এবং সহযোগীদের দ্বারা শেয়ার করা তথ্য বা বিজ্ঞাপন অংশীদার এবং সহযোগীদের ওয়েবসাইট এবং অ্যাপ্লিকেশানগুলি থেকে স্টার দ্বারা সংগৃহীত তথ্যগুলি স্টার এর সাথে আপনার শেয়ার করা অন্যান্য তথ্যের সাথে মিলিত হতে পারে এবং স্টার এই গোপনীয়তা নীতিতে অন্য কোথাও বর্ণিত আপনার সম্পর্কে প্রাপ্ত, তৈরি বা অনুমান করে৷

                    অন্যান্য তৃতীয় পক্ষ, অ্যাকাউন্ট সংযোগ এবং ইন্টিগ্রেশন। আমরা তৃতীয় পক্ষের কাছ থেকে আপনার সম্পর্কে তথ্য পেতে পারি যারা আমাদের বিজ্ঞাপন অংশীদার নন, যেমন অন্যান্য স্টার ব্যবহারকারী, বিকাশকারী এবং অংশীদার যারা আমাদের প্ল্যাটফর্ম, আমাদের কর্পোরেট অ্যাফিলিয়েট এবং আপনার লিঙ্ক করা অন্যান্য পরিষেবাগুলিতে সামগ্রীর নিরাপত্তা এবং গুণমান মূল্যায়ন করতে সহায়তা করে আপনার স্টার অ্যাকাউন্ট। আপনি অন্য পরিষেবাতে আপনার অ্যাকাউন্টের সাথে আপনার স্টার অ্যাকাউন্ট সংযোগ করতে বেছে নিতে পারেন, এবং সেই পরিষেবাটি আমাদের কাছে আপনার অ্যাকাউন্ট সম্পর্কে তথ্য পাঠাতে পারে৷</h4>
                <h4>
                    <!--
           আপনি কিভাবে আমার তথ্য ব্যবহার করবেন?
            স্টার আপনি জানেন এবং ভালবাসেন সেবা করতে.
-->
                    2. আমরা কিভাবে তথ্য ব্যবহার করি,<br>

                    আমরা যে তথ্য সংগ্রহ করি তা আমরা কীভাবে ব্যবহার করি তা ভেঙে ফেলা সহজ নয় কারণ যে সিস্টেমগুলি আপনার কাছে আমাদের পরিষেবা নিয়ে আসে সেগুলি যেভাবে কাজ করে৷ উদাহরণস্বরূপ, শেষ পর্যন্ত একটি একক পরিষেবা প্রদানের জন্য একই তথ্যের টুকরো বিভিন্ন উদ্দেশ্যে ভিন্নভাবে ব্যবহার করা যেতে পারে। আমরা মনে করি যে পাঁচটি প্রধান উপায়ে আমরা তথ্য ব্যবহার করি তা বর্ণনা করা সবচেয়ে উপযোগী এবং আপনার যদি এমন প্রশ্ন থাকে যার উত্তর না পাওয়া যায়, আপনি সর্বদা আমাদের সাথে যোগাযোগ করতে পারেন।
                    //starcontactus
                    <!--            আরও তথ্যের জন্য ড্রপডাউন প্রসারিত করুন:-->
                </h4>
                <h4>2.1 আমাদের পরিষেবাগুলি পরিচালনা করুন, উন্নত করুন এবং ব্যক্তিগতকৃত করুন৷

                    আমরা স্টার পণ্য এবং পরিষেবাগুলি প্রদান এবং পরিচালনা করতে আমাদের সংগ্রহ করা তথ্য ব্যবহার করি। আমরা আমাদের পণ্য এবং পরিষেবাগুলিকে উন্নত এবং ব্যক্তিগতকৃত করার জন্য আমরা যে তথ্য সংগ্রহ করি তাও ব্যবহার করি যাতে আপনাকে আরও প্রাসঙ্গিক বিষয়বস্তু এবং বিজ্ঞাপন দেখানো, লোকেদের এবং বিষয়গুলি অনুসরণ করার পরামর্শ দেওয়া, সক্রিয় করা এবং আপনাকে সহযোগীদের আবিষ্কার করতে সহায়তা করা সহ স্টার-এ আরও ভাল অভিজ্ঞতা লাভ করে।
                    <br>পার্টি অ্যাপস এবং পরিষেবা। <br>
                    আমরা এই নীতিতে বর্ণিত উদ্দেশ্যগুলির জন্য আমাদের মেশিন লার্নিং বা কৃত্রিম বুদ্ধিমত্তা মডেলগুলিকে প্রশিক্ষণ দিতে সাহায্য করার জন্য আমরা সংগ্রহ করা তথ্য এবং সর্বজনীনভাবে উপলব্ধ তথ্য ব্যবহার করতে পারি।

                    <!-- আপনি ক্রস-পোস্টিং বা ক্রস-সার্ভিস প্রমাণীকরণের মতো বৈশিষ্ট্যগুলি প্রদান করতে এবং আমাদের পরিষেবাগুলি পরিচালনা করতে আপনার স্টার অ্যাকাউন্ট সংযোগ করার জন্য বেছে নেওয়া অন্যান্য পরিষেবাগুলির অ্যাকাউন্ট থেকে আমরা যে তথ্য সংগ্রহ করি তা আমরা ব্যবহার করতে পারি। -->

                    তৃতীয় পক্ষের পরিষেবা এবং ক্লায়েন্ট অ্যাপ্লিকেশন সহ আপনার সেটিংস অনুমতি দিলে আমরা আপনার অ্যাকাউন্ট খুঁজে পেতে অন্যদের সাহায্য করতে আপনার যোগাযোগের তথ্য ব্যবহার করি।

                    ভিতরে বিভিন্ন ডেটা উপস্থাপনা আইকন সহ চালু/বন্ধ অবস্থায় দুটি টগল সুইচ। সবুজ "চালু" টগলটি গ্রেস্কেল "অফ" টগলের চেয়ে বেশি আইকনে পূর্ণ।
                    আমরা আপনার সেটিংস সাপেক্ষে আমাদের বিজ্ঞাপন এবং স্পনসর করা বিষয়বস্তু পরিষেবা প্রদান করতে আপনার তথ্য ব্যবহার করি, যা আপনার জন্য স্টার-এ বিজ্ঞাপনগুলিকে আরও প্রাসঙ্গিক করতে সাহায্য করে। এছাড়াও আমরা বিজ্ঞাপনের কার্যকারিতা পরিমাপ করতে এবং স্টার-এর উপর এবং বাইরে আপনাকে বিজ্ঞাপন পরিবেশন করার জন্য আপনার ডিভাইসগুলিকে চিনতে সাহায্য করার জন্য এই তথ্যটি ব্যবহার করি। আমাদের কিছু বিজ্ঞাপন অংশীদার আমাদের বিজ্ঞাপন প্রযুক্তিকে একীভূত করে সরাসরি তাদের ওয়েবসাইট বা অ্যাপ থেকে অনুরূপ তথ্য সংগ্রহ করতে সক্ষম করে। 
                    <!-- বিজ্ঞাপন অংশীদার এবং সহযোগীদের দ্বারা শেয়ার করা তথ্য বা বিজ্ঞাপন অংশীদার এবং সহযোগীদের ওয়েবসাইট এবং অ্যাপ থেকে স্টার দ্বারা সংগৃহীত অন্যান্য তথ্যের সাথে একত্রিত হতে পারে যা আপনি স্টার-এর সাথে শেয়ার করেন এবং স্টার আপনার সম্পর্কে প্রাপ্ত, উৎপন্ন বা অনুমান করে, যেমন আমাদের গোপনীয়তার অন্য কোথাও বর্ণনা করা হয়েছে। -->
                    <br><br>
                    <!-- নীতি. -->
                </h4>
                <h4>2.2 নিরাপত্তা এবং নিরাপত্তা লালনপালন।<br>

                    আমরা আমাদের ব্যবহারকারী, আমাদের পণ্য, পরিষেবা এবং আপনার অ্যাকাউন্টের নিরাপত্তা এবং নিরাপত্তা প্রদানের জন্য আমরা সংগ্রহ করা তথ্য ব্যবহার করি। এর মধ্যে রয়েছে আপনার পরিচয় যাচাই করা, আপনার অ্যাকাউন্টের প্রমাণীকরণ এবং জালিয়াতি, অননুমোদিত ব্যবহার এবং অবৈধ কার্যকলাপের বিরুদ্ধে রক্ষা করা। আমরা স্টার-এ বিষয়বস্তুর নিরাপত্তা ও গুণমান মূল্যায়ন ও প্রভাবিত করার জন্যও তথ্য ব্যবহার করি - এর মধ্যে আমাদের নীতি এবং শর্তাবলী এবং সেইসাথে প্রযোজ্য আইনের তদন্ত ও প্রয়োগ অন্তর্ভুক্ত রয়েছে।</h4>
                   // star law
                <h4>2.3 পরিমাপ করুন, বিশ্লেষণ করুন এবং আমাদের পরিষেবাগুলি আরও ভাল করুন৷

                    আমরা আমাদের পণ্য এবং পরিষেবাগুলির কার্যকারিতা পরিমাপ এবং বিশ্লেষণ করতে এবং সেগুলিকে আরও ভাল করার জন্য আপনি কীভাবে সেগুলি ব্যবহার করেন তা আরও ভালভাবে বোঝার জন্য আমরা সংগ্রহ করা তথ্য ব্যবহার করি।</h4>
                <h4>2.4 আমাদের পরিষেবাগুলি সম্পর্কে আপনার সাথে যোগাযোগ করুন৷

                    পণ্য আপডেট এবং আমাদের নীতি ও শর্তাবলীর পরিবর্তন সহ আমাদের পণ্য এবং পরিষেবাগুলি সম্পর্কে আপনার সাথে যোগাযোগ করতে আমরা যে তথ্য সংগ্রহ করি তা ব্যবহার করি। আপনি যদি আমাদের কাছ থেকে শোনার জন্য উন্মুক্ত হন তবে আমরা আপনাকে সময়ে সময়ে বিপণন বার্তা পাঠাতে পারি।</h4>
                //star ads
                    <h4>2.5 গবেষণা।<br>

                    আপনি আমাদের সাথে শেয়ার করেন এমন তথ্য বা আমরা গবেষণা, সমীক্ষা, পণ্য পরীক্ষা এবং সমস্যা সমাধানের জন্য আমাদের পণ্য ও পরিষেবাগুলি পরিচালনা এবং উন্নত করতে সাহায্য করার জন্য ব্যবহার করি। </h4>
                <h4>কিভাবে বা কখন আপনি স্টারের সাথে তথ্য শেয়ার করবেন?<br>
                    এটির কোন দ্রুত উত্তর নেই, তবে মাথা আপ করুন: পোস্টগুলি সংবাদ বা সার্চ ইঞ্জিনে শেষ হতে পারে।
                    <br>
                    3. তথ্য শেয়ার করা<br>

                    আমরা কীভাবে আপনার তথ্য শেয়ার করি, কেন আমরা এটি শেয়ার করি এবং কীভাবে আপনি এটি নিয়ন্ত্রণ করতে পারেন তা আপনার জানা উচিত। আমরা আপনার তথ্য শেয়ার করার জন্য পাঁচটি সাধারণ উপায় আছে।
                    <br>
                    3.1 যখন আপনি পোস্ট এবং শেয়ার করুন.<br>

                    সাধারণ জনগণের সাথে। আপনি আমাদেরকে সেই তথ্য যতটা সম্ভব বিস্তৃতভাবে প্রকাশ করার নির্দেশ দিচ্ছেন। আপনার প্রোফাইল তথ্য সহ স্টার সামগ্রী (যেমন, নাম/ছদ্মনাম, ব্যবহারকারীর নাম, প্রোফাইল ছবি) সাধারণ জনগণের দেখার জন্য উপলব্ধ। স্টার-এ কিছু বিষয়বস্তু দেখার জন্য জনসাধারণের সাইন ইন করার দরকার নেই। তারা স্টার-এর বাইরে স্টার-এর বিষয়বস্তুও খুঁজে পেতে পারে, উদাহরণস্বরূপ ইন্টারনেট সার্চ ইঞ্জিনে অনুসন্ধান ক্যোয়ারী ফলাফল থেকে।

                    অন্যান্য স্টার ব্যবহারকারীদের সাথে। 
                    
                    <!-- আপনার সেটিংসের উপর নির্ভর করে এবং আপনার ব্যবহার করা স্টার পণ্য এবং পরিষেবাগুলির উপর ভিত্তি করে, আমরা শেয়ার করি:

                    অন্যান্য ব্যবহারকারীদের স্টার বিষয়বস্তুর সাথে আপনার মিথস্ক্রিয়া, যেমন লাইক, এবং আপনি অনুসরণ করা লোকেদের। -->
                    কোনো নির্দিষ্ট স্টার ব্যবহারকারীকে আপনি যে সামগ্রী পাঠান, যেমন সরাসরি বার্তার মাধ্যমে। অনুগ্রহ করে মনে রাখবেন যে আপনি যদি তৃতীয় পক্ষের পরিষেবার মাধ্যমে স্টার অ্যাক্সেস করে এমন অন্য কারো সাথে সরাসরি বার্তা বা সুরক্ষিত পোস্টের মতো তথ্য ভাগ করে থাকেন তবে তথ্যটি তৃতীয় পক্ষের পরিষেবার সাথে ভাগ করা হতে পারে৷
                    অংশীদারদের সাথে। আপনার সেটিংসের উপর নির্ভর করে, আমরা আমাদের পণ্য এবং পরিষেবাগুলি অফার করতে বা পরিচালনা করতে সহায়তা করার জন্য কিছু তৃতীয় পক্ষকে তথ্য সরবরাহ করি। আপনি আমাদের সহায়তা কেন্দ্রে এই অংশীদারিত্ব সম্পর্কে আরও জানতে পারেন৷ আপনার গোপনীয়তা এবং নিরাপত্তা সেটিংসে "ব্যবসায়িক অংশীদারদের সাথে ডেটা ভাগ করে নেওয়া" বিকল্পটি ব্যবহার করে স্টার এই অংশীদারদের সাথে আপনার ব্যক্তিগত তথ্য ভাগ করে কিনা তা নিয়ন্ত্রণ করতে পারেন৷ (এই সেটিং এই গোপনীয়তা নীতিতে বর্ণিত অন্য কোথাও ভাগ করা নিয়ন্ত্রণ করে না, যেমন আমরা যখন আমাদের পরিষেবা প্রদানকারীদের সাথে তথ্য ভাগ করি, বা এই সহায়তা কেন্দ্র নিবন্ধে বর্ণিত ব্যতীত অন্য অংশীদারিত্বের মাধ্যমে।)
                </h4>
                <h4>3.2 তৃতীয় পক্ষ এবং তৃতীয় পক্ষের ইন্টিগ্রেশন সহ।

                    পরিষেবা প্রদানকারীদের সাথে। আমরা আপনার তথ্য আমাদের পরিষেবা প্রদানকারীদের সাথে শেয়ার করতে পারি যারা আমাদের পক্ষ থেকে কার্য সম্পাদন করে এবং পরিষেবা প্রদান করে, অর্থপ্রদানের সুবিধা প্রদানকারী পেমেন্ট পরিষেবা প্রদানকারী সহ; আমাদের বিভিন্ন ব্লগ এবং উইকি হোস্ট করা পরিষেবা প্রদানকারী; পরিষেবা প্রদানকারী যারা আমাদের পরিষেবার ব্যবহার বুঝতে সাহায্য করে; আবেদনকারী ট্র্যাকিং সিস্টেম প্রদানকারীরা সম্ভাব্য নিয়োগকর্তাদের আবেদনকারী এবং কাজের ডেটা পাঠাতে এবং গ্রহণ করতে; এবং যারা জালিয়াতি সনাক্তকরণ পরিষেবা প্রদান করে।

                    বিজ্ঞাপনদাতাদের সাথে। বিজ্ঞাপনের আয় আমাদের পণ্য এবং পরিষেবা প্রদান করতে সক্ষম করে। বিজ্ঞাপনদাতারা স্টার-তে বা বন্ধ করে তাদের বিজ্ঞাপনের সাথে আপনার ব্যস্ততা থেকে তথ্য শিখতে পারে। উদাহরণস্বরূপ, আপনি যদি আমাদের পরিষেবাগুলিতে একটি বাহ্যিক লিঙ্ক বা বিজ্ঞাপনে ক্লিক করেন, সেই বিজ্ঞাপনদাতা বা ওয়েবসাইট অপারেটর বুঝতে পারেন যে আপনি স্টার থেকে এসেছেন, সাথে সংশ্লিষ্ট অন্যান্য তথ্য সহ আপনি যে বিজ্ঞাপনে ক্লিক করেছেন, যেমন দর্শকদের বৈশিষ্ট্য যা পৌঁছানোর উদ্দেশ্যে ছিল এবং সেই বিজ্ঞাপনের জন্য অন্যান্য স্টার-জেনারেটেড শনাক্তকারী। তারা আপনার কাছ থেকে অন্যান্য ব্যক্তিগত তথ্যও সংগ্রহ করতে পারে, যেমন কুকি শনাক্তকারী বা আপনার আইপি ঠিকানা।

                    তৃতীয় পক্ষের বিষয়বস্তু এবং ইন্টিগ্রেশন। আমরা আপনার সম্মতিতে বা আপনার নির্দেশে আপনার তথ্য শেয়ার করি বা প্রকাশ করি, যেমন আপনি যখন আপনার অ্যাকাউন্ট অ্যাক্সেস করার জন্য তৃতীয় পক্ষের ওয়েব ক্লায়েন্ট বা অ্যাপ্লিকেশন অনুমোদন করেন বা যখন আপনি আমাদেরকে একটি ব্যবসার সাথে আপনার প্রতিক্রিয়া ভাগ করার জন্য নির্দেশ দেন। একইভাবে, আপনার অভিজ্ঞতা উন্নত করতে, আমরা তৃতীয় পক্ষের অংশীদারদের সাথে স্টার-তে তাদের ভিডিও সামগ্রী প্রদর্শন করতে বা ক্রস-প্ল্যাটফর্ম ভাগাভাগি করার অনুমতি দেওয়ার জন্য কাজ করি। আপনি যখন আমাদের ভিডিও বা ক্রস-প্ল্যাটফর্ম শেয়ারিং অংশীদারদের থেকে সামগ্রী দেখেন বা অন্যভাবে ইন্টারঅ্যাক্ট করেন, তখন তারা তাদের গোপনীয়তা নীতিতে বর্ণিত আপনার ব্যক্তিগত তথ্য গ্রহণ এবং প্রক্রিয়া করতে পারে। ভিডিও সামগ্রীর জন্য, আপনি যদি সেই সামগ্রীটি স্বয়ংক্রিয়ভাবে না চালানো পছন্দ করেন তবে আপনি আপনার অটোপ্লে সেটিংস সামঞ্জস্য করতে পারেন৷

                    আমাদের API এর মাধ্যমে। ওয়েবসাইট, অ্যাপ এবং অন্যদের ব্যবহারের জন্য সর্বজনীন স্টার তথ্য উপলব্ধ করতে আমরা API এবং এম্বেডের মতো প্রযুক্তি ব্যবহার করি, উদাহরণস্বরূপ, একটি সংবাদ ওয়েবসাইটে পোস্ট প্রদর্শন করা বা স্টার-এ লোকেরা কী বলে তা বিশ্লেষণ করা। আমরা সাধারণত এই সামগ্রীটি সীমিত পরিমাণে উপলব্ধ করি। বিনামূল্যের জন্য এবং বড় আকারের অ্যাক্সেসের জন্য লাইসেন্সিং ফি চার্জ করুন। আমাদের কাছে স্ট্যান্ডার্ড শর্তাবলী রয়েছে যা এই তথ্যগুলিকে কীভাবে ব্যবহার করা যেতে পারে তা নিয়ন্ত্রণ করে এবং এই শর্তাবলী প্রয়োগ করার জন্য একটি সম্মতি প্রোগ্রাম রয়েছে। কিন্তু এই ব্যক্তি এবং কোম্পানিগুলি স্টার-এর সাথে অনুমোদিত নয়, এবং তাদের অফারগুলি স্টার-এ আপনার করা আপডেটগুলিকে প্রতিফলিত নাও করতে পারে৷ আমরা কীভাবে স্টার-এ সর্বজনীন ডেটা বিশ্বের কাছে উপলব্ধ করি সে সম্পর্কে আরও তথ্যের জন্য, https://developer.star.com এ যান৷</h4>
                <h4>3.3 যখন আইন দ্বারা প্রয়োজন হয়, ক্ষতি প্রতিরোধ করতে, বা জনস্বার্থে।

                    আমরা আপনার তথ্য সংরক্ষণ, ব্যবহার, ভাগ বা প্রকাশ করতে পারি যদি আমরা বিশ্বাস করি যে এটি করা যুক্তিসঙ্গতভাবে প্রয়োজনীয়:

                    একটি আইন, প্রবিধান, আইনি প্রক্রিয়া, বা সরকারী অনুরোধ মেনে চলা;

                    আমাদের পরিষেবাগুলিতে স্প্যাম, অপব্যবহার, বা দূষিত অভিনেতা প্রতিরোধে সহায়তা সহ যে কোনও ব্যক্তির সুরক্ষা, আমাদের প্ল্যাটফর্মের সুরক্ষা বা অখণ্ডতা রক্ষা করা;

                    ব্যাখ্যা করুন কেন আমরা আমাদের পরিষেবাগুলি থেকে সামগ্রী বা অ্যাকাউন্টগুলি সরিয়েছি (যেমন, আমাদের নিয়ম লঙ্ঘনের জন্য);

                    জালিয়াতি, নিরাপত্তা, বা প্রযুক্তিগত সমস্যা সমাধান; বা

                    আমাদের অধিকার বা সম্পত্তি, বা যারা আমাদের পরিষেবা ব্যবহার করেন তাদের অধিকার বা সম্পত্তি রক্ষা করুন।</h4>
                <h4>3.4 আমাদের অ্যাফিলিয়েটদের সাথে।

                    আমরা আমাদের পণ্য এবং পরিষেবা প্রদানের জন্য আমাদের সহযোগীদের মধ্যে তথ্য শেয়ার করতে পারি।</h4>
                <h4>3.5 মালিকানা পরিবর্তনের ফলে।

                    আমরা একীভূতকরণ, অধিগ্রহণ, পুনর্গঠন, সম্পদ বিক্রি বা দেউলিয়া হওয়ার সাথে সম্পর্কিত আপনার সম্পর্কে তথ্য শেয়ার, বিক্রয় বা স্থানান্তর করতে পারি। এই গোপনীয়তা নীতি আপনার ব্যক্তিগত তথ্যের ক্ষেত্রে প্রযোজ্য হবে যা শেয়ার করা হয়েছে (যেকোনো লেনদেনের আগে এবং পরে) বা নতুন সত্তার কাছে স্থানান্তর করা হয়েছে।
                </h4>
                <h4>আপনি কতক্ষণ ডেটা রাখেন?<br>
                    সাধারণত, যতক্ষণ আপনার অ্যাকাউন্ট থাকে ততক্ষণ আমরা আপনার ডেটা রাখি।

                    4. আমরা কতক্ষণ তথ্য রাখি

                    আমরা বিভিন্ন সময়ের জন্য বিভিন্ন ধরনের তথ্য রাখি:

                    আমরা আপনার অ্যাকাউন্টের সময়কালের জন্য আপনার প্রোফাইল তথ্য এবং সামগ্রী রাখি।

                    আপনি যখন সর্বোচ্চ 18 মাসের জন্য আমাদের পণ্য এবং পরিষেবাগুলি ব্যবহার করেন তখন আমরা সাধারণত অন্যান্য ব্যক্তিগতভাবে শনাক্তযোগ্য ডেটা রাখি যা আমরা সংগ্রহ করি।

                    মনে রাখবেন যে সর্বজনীন বিষয়বস্তু আপনি স্টার থেকে মুছে ফেলার পরেও অন্য কোথাও থাকতে পারে৷ উদাহরণস্বরূপ, সার্চ ইঞ্জিন এবং অন্যান্য তৃতীয় পক্ষগুলি তাদের নিজস্ব গোপনীয়তা নীতির উপর ভিত্তি করে আপনার পোস্টগুলির অনুলিপিগুলিকে দীর্ঘক্ষণ ধরে রাখতে পারে, এমনকি সেগুলি স্টার-তে মুছে ফেলা বা মেয়াদ শেষ হওয়ার পরেও৷

                    যেখানে আপনি আমাদের নিয়ম লঙ্ঘন করেন এবং আপনার অ্যাকাউন্ট স্থগিত করা হয়, সেখানে আমরা অ্যাকাউন্ট তৈরি করতে আপনার ব্যবহৃত শনাক্তকারীগুলিকে (যেমন, ইমেল ঠিকানা বা ফোন নম্বর) অনির্দিষ্টকালের জন্য রাখতে পারি যাতে পুনরাবৃত্তি নীতি অপরাধীদের নতুন অ্যাকাউন্ট তৈরি করা থেকে বিরত থাকে।

                    আইনি প্রয়োজনীয়তা মেনে চলার জন্য এবং নিরাপত্তা ও নিরাপত্তার কারণে আমরা নির্দিষ্ট কিছু তথ্য আমাদের নীতিমালার থেকে বেশি সময় ধরে রাখতে পারি।
                </h4>
                <h4>আমি কিভাবে আমার ডেটা নিয়ন্ত্রণ করতে পারি?
                    আপনি এটি অ্যাক্সেস করতে, এটি মুছে ফেলতে বা আপনার সেটিংস পরিবর্তন করতে পারেন৷ মূলত, আপনি বস।
                    <br>
                    5. নিয়ন্ত্রণ নিন<br>
                </h4>
                <h4>5.1 অ্যাক্সেস, সংশোধন, বহনযোগ্যতা।<br>

                    আপনি আপনার প্রোফাইল সম্পাদনা করে এবং আপনার অ্যাকাউন্ট সেটিংস সামঞ্জস্য করে আপনার দেওয়া তথ্য অ্যাক্সেস করতে, সংশোধন করতে বা পরিবর্তন করতে পারেন৷

                    আমরা আপনার স্টার ডেটাতে আপনার সম্পর্কে যে তথ্য সংগ্রহ করেছি বা অনুমান করেছি সে সম্পর্কে আপনি আরও জানতে পারেন এবং এখানে অতিরিক্ত তথ্য অ্যাক্সেসের অনুরোধ করতে পারেন।

                    আপনি এখানে নির্দেশাবলী অনুসরণ করে আপনার তথ্যের একটি অনুলিপি ডাউনলোড করতে পারেন, যেমন আপনার পোস্টগুলি।

                    আপনার গোপনীয়তা রক্ষা করতে এবং নিরাপত্তা বজায় রাখতে, আমরা আপনাকে আপনার ব্যক্তিগত তথ্যে অ্যাক্সেস দেওয়ার আগে বা মুছে ফেলা, বহনযোগ্যতা বা অন্যান্য সম্পর্কিত অনুরোধ মেনে চলার আগে আপনার পরিচয় যাচাই করার জন্য পদক্ষেপ নিই। আমরা, কিছু পরিস্থিতিতে, অ্যাক্সেস, সংশোধন বা বহনযোগ্যতার জন্য আপনার অনুরোধ প্রত্যাখ্যান করতে পারি, উদাহরণস্বরূপ, আমরা অ্যাক্সেস প্রত্যাখ্যান করতে পারি যেখানে আপনি আপনার পরিচয় যাচাই করতে অক্ষম।
                </h4>
                <h4>
                    5.2 আপনার তথ্য মুছে ফেলা।

                    আপনি এখানে নির্দেশাবলী অনুসরণ করলে, আপনার অ্যাকাউন্ট নিষ্ক্রিয় করা হবে এবং আপনার ডেটা মুছে ফেলার জন্য সারিবদ্ধ করা হবে। নিষ্ক্রিয় করা হলে, আপনার প্রদর্শন নাম, ব্যবহারকারীর নাম এবং সর্বজনীন প্রোফাইল সহ আপনার স্টার অ্যাকাউন্ট আর star.com, iOS-এর জন্য স্টার এবং Android-এর জন্য স্টার-এ দেখা যাবে না৷ নিষ্ক্রিয়করণের পরে 30 দিন পর্যন্ত আপনার স্টার অ্যাকাউন্টটি ভুলবশত বা ভুলভাবে নিষ্ক্রিয় হয়ে গেলে পুনরুদ্ধার করা সম্ভব না।
                </h4>
                <h4>5.3 আপনার সম্মতিতে আপত্তি করা, সীমাবদ্ধ করা বা প্রত্যাহার করা।

                    আপনি এখানে আপনার গোপনীয়তা সেটিংস এবং অন্যান্য অ্যাকাউন্ট বৈশিষ্ট্যগুলি পরিচালনা করতে পারেন৷ আপনি যদি আপনার সেটিংস পরিবর্তন করেন তবে আমাদের সিস্টেম জুড়ে আপনার পছন্দগুলি সম্পূর্ণরূপে প্রতিফলিত হতে কিছু সময় লাগতে পারে। আপনি আপনার স্টার অভিজ্ঞতার পরিবর্তন বা আপনার সামঞ্জস্য করা সেটিংসের উপর নির্ভর করে নির্দিষ্ট বৈশিষ্ট্যগুলি অ্যাক্সেস করার ক্ষমতার সীমাবদ্ধতাগুলিও লক্ষ্য করতে পারেন। প্ল্যাটফর্মের বিভিন্ন অংশে নির্দিষ্ট বিষয়বস্তু এবং বৈশিষ্ট্যগুলির সাথে ইন্টারঅ্যাক্ট করার সময় আপনি অতিরিক্ত সেটিংস পরিচালনা করতে পারেন, যেমন একটি স্পেস রেকর্ড করা হয়েছে কিনা বা আপনার আপলোড করা ভিডিওগুলি অন্যদের দ্বারা ডাউনলোডযোগ্য কিনা।

                    স্টার অনলাইন আচরণগত বিজ্ঞাপনের জন্য ডিজিটাল বিজ্ঞাপন জোটের স্ব-নিয়ন্ত্রক নীতিগুলি মেনে চলে (এটি "আগ্রহ-ভিত্তিক বিজ্ঞাপন" হিসাবেও উল্লেখ করা হয়) এবং https://optout-এ আপনার আগ্রহ-ভিত্তিক বিজ্ঞাপনগুলি অপ্ট আউট করার জন্য DAA-এর ভোক্তা পছন্দের সরঞ্জামকে সম্মান করে৷ .aboutads.info/</h4>
                <h4>5.4 অনুমোদিত এজেন্টের অনুরোধ।

                    আপনি যদি তাদের অনুমোদিত এজেন্ট হন তবে আপনার তথ্যের অ্যাক্সেস, পরিবর্তন বা মুছে ফেলার সাথে সম্পর্কিত একটি অনুরোধ জমা দিতে, আপনি আমাদের সাথে যোগাযোগ করতে পারেন যেভাবে নীচে আমাদের গোপনীয়তা নীতির স্টার-এর সাথে যোগাযোগ করতে হবে বিভাগে উল্লেখ করা আছে। আমরা আপনাকে যাচাইকরণের জন্য অতিরিক্ত তথ্য প্রদানের প্রয়োজন হতে পারে।</h4>
                <h4>আমি যেখানেই থাকি না কেন স্টার কীভাবে আমার তথ্য পরিচালনা করে?
                    আপনি বিশ্বজুড়ে যেখানেই থাকুন না কেন আমরা আপনার তথ্যকে ন্যায্যভাবে ব্যবহার করি।
                    <br>
                    6. আপনার অধিকার এবং আমাদের<br>

                    আমরা সারা বিশ্বের লোকেদের কাছে স্টার প্রদান করি এবং আমাদের সকল ব্যবহারকারীকে তারা যেখানেই থাকুক না কেন একই গোপনীয়তা সরঞ্জাম এবং নিয়ন্ত্রণ প্রদান করি। যাইহোক, স্টার স্থানীয় প্রয়োজনীয়তাগুলিকে সম্মান করে তা নিশ্চিত করতে আপনার অভিজ্ঞতা অন্যান্য দেশের ব্যবহারকারীদের থেকে কিছুটা আলাদা হতে পারে।

                </h4>
                <h4>6.1 আপনার তথ্য ব্যবহার করার জন্য আমাদের নির্দিষ্ট আইনি ভিত্তি রয়েছে।

                    স্টার আপনার তথ্য সংগ্রহ, ব্যবহার, শেয়ার এবং অন্যথায় প্রক্রিয়া করার জন্য অনুমোদিত আইনি কারণগুলি সাবধানতার সাথে বিবেচনা করেছে। আপনি যদি আরও জানতে এবং সূক্ষ্ম বিষয়গুলি আরও ভালভাবে বুঝতে খনন করতে চান তবে আমরা আপনাকে ডেটা প্রক্রিয়াকরণ সম্পর্কে এই অতিরিক্ত তথ্যটি পরীক্ষা করার জন্য উত্সাহিত করব। এবং না, আমরা আপনার ব্যক্তিগত তথ্য বিক্রি করি না।</h4>
                <h4>6.2 আমরা আপনার ডেটা স্থানান্তর করি যাতে স্টার আপনার জন্য কাজ করে।

                    আপনি যেমন স্টার ব্যবহার করেন বিশ্বের বিভিন্ন দেশের মানুষের সাথে বিশ্বব্যাপী কথোপকথনে নির্বিঘ্নে অংশগ্রহণ করার জন্য, স্টার-কে অবশ্যই সীমানা পেরিয়ে এবং বিশ্বের বিভিন্ন দেশে আপনার নির্ভরশীল নিরাপদ এবং নির্ভরযোগ্য পরিষেবাকে সমর্থন করার জন্য তথ্য স্থানান্তর করতে হবে। উদাহরণস্বরূপ, আপনি যদি ইউরোপে থাকেন এবং মার্কিন যুক্তরাষ্ট্রে কারও সাথে কথোপকথন করছেন, সেই অভিজ্ঞতা প্রদানের জন্য তথ্যগুলিকে সেই দেশগুলির মধ্যে স্থানান্তর করতে হবে - এটি আপনি আমাদের কাছ থেকে আশা করেন৷

                    এছাড়াও আমরা ডেটা সেন্টার এবং ক্লাউড প্রদানকারী ব্যবহার করি এবং আমাদের সেবা প্রদানে সহায়তা করার জন্য বিশ্বের বিভিন্ন স্থানে অবস্থিত আমাদের সহযোগী এবং তৃতীয় পক্ষের অংশীদার এবং পরিষেবা প্রদানকারীদের নিযুক্ত করি। দেশগুলির মধ্যে ডেটা স্থানান্তর করার আগে আমরা ডেটাতে উপস্থাপিত হতে পারে এমন ঝুঁকিগুলি দেখি এবং আপনার ডেটা অধিকারগুলি সুরক্ষিত আছে তা নিশ্চিত করার জন্য প্রযোজ্য চুক্তির ধারাগুলির মতো জিনিসগুলির উপর নির্ভর করি৷ যদি কোনও তৃতীয় পক্ষের সাথে ডেটা ভাগ করা হয়, তবে আমরা তাদের আপনার ডেটার উপর একই সুরক্ষা বজায় রাখতে চাই যা আমরা সরাসরি সরবরাহ করি।</h4>
                <h4>স্টার কি বাচ্চাদের জন্য?
                    না,স্টার 15 বছরের কম বয়সীদের জন্য নয়।
                    <br>
                    7. স্টার​ এর শ্রোতা
                    <br>
                    আমাদের পরিষেবাগুলি শিশুদের জন্য নির্দেশিত নয়, এবং আপনার বয়স 15 বছরের কম হলে আপনি আমাদের পরিষেবাগুলি ব্যবহার নাও করতে পারেন৷ আপনার দেশে আপনার ব্যক্তিগত ডেটা প্রক্রিয়াকরণে সম্মতি দেওয়ার জন্য আপনাকে অবশ্যই যথেষ্ট বয়স্ক হতে হবে (কিছু দেশে আমরা অনুমতি দিতে পারি আপনার পিতামাতা বা অভিভাবক আপনার পক্ষে এটি করতে)।
                </h4>
                <h4>এই নীতি কি পরিবর্তন হবে?
                    যদি তা হয়, আমরা আপনাকে জানাব।

                    8. এই গোপনীয়তা নীতিতে পরিবর্তন
                    এই গোপনীয়তা নীতির সবচেয়ে সাম্প্রতিক সংস্করণটি আপনার ব্যক্তিগত ডেটার আমাদের প্রক্রিয়াকরণকে নিয়ন্ত্রণ করে এবং আমরা প্রয়োজনে সময়ে সময়ে এই গোপনীয়তা নীতি সংশোধন করতে পারি।

                    যদি আমরা এই গোপনীয়তা নীতিটি সংশোধন করি এবং পরিবর্তন করি যা আমাদের দ্বারা উপাদান হিসাবে নির্ধারিত হয়, তাহলে আপনি স্টার ব্যবহার করা চালিয়ে যাওয়ার আগে আমরা আপনাকে বিজ্ঞপ্তি এবং সংশোধিত গোপনীয়তা নীতি পর্যালোচনা করার সুযোগ দেব।

                    এই নীতি কি অন্য ভাষায় দেখা যায়?
                    হ্যাঁ কিন্তু...

                    9. সাধারণ
                    স্টার গোপনীয়তা নীতি ইংরেজিতে লেখা কিন্তু অনুবাদের মাধ্যমে একাধিক ভাষায় উপলব্ধ করা হয়েছে। স্টার মূল ইংরেজি সংস্করণে অনুবাদগুলো যথাসম্ভব নির্ভুল করার চেষ্টা করে। যাইহোক, কোনো অসঙ্গতি বা অসঙ্গতির ক্ষেত্রে, স্টার গোপনীয়তা নীতির ইংরেজি ভাষার সংস্করণটি অগ্রাধিকার পাবে। আপনি স্বীকার করেন যে ইংরেজি স্টার গোপনীয়তা নীতির শর্তাবলী ব্যাখ্যা এবং নির্মাণের জন্য রেফারেন্সের ভাষা হবে।
<br>
                    আমি কিভাবে স্টার এর সাথে যোগাযোগ করতে পারি?
                    আমাদের … খুব অফিসিয়াল ইনবক্সে স্লাইড করুন।

<br>
                    10. কিভাবে স্টার সাথে যোগাযোগ করবেন

                    এই গোপনীয়তা নীতি সম্পর্কে আপনার চিন্তা বা প্রশ্ন থাকলে আমরা আপনার কাছ থেকে শুনতে চাই। আপনি আমাদের গোপনীয়তা নীতি অনুসন্ধান পৃষ্ঠার মাধ্যমে বা নীচের উপযুক্ত ঠিকানায় আমাদের কাছে লিখে আমাদের সাথে যোগাযোগ করতে পারেন৷ 
<!--                    আমাদের ক্যালিফোর্নিয়া কনজিউমার প্রাইভেসি অ্যাক্ট (CCPA) অনুরোধগুলি পরিচালনা করার বিষয়ে তথ্য এখানে উপলব্ধ।-->

                    আপনি যদি মার্কিন যুক্তরাষ্ট্রে বা ইউরোপীয় ইউনিয়ন, EFTA রাজ্য বা যুক্তরাজ্যের বাইরে অন্য কোনো দেশে বাস করেন, তাহলে আপনার ব্যক্তিগত ডেটার জন্য দায়ী ডেটা কন্ট্রোলার হল X Corp., যার একটি ঠিকানা রয়েছে:

                    স্টার কর্পোরেশন
                    ঢাকা, বাংলাদেশ
                    
                    আপনি যদি ইউরোপীয় ইউনিয়ন, ইএফটিএ স্টেটস বা ইউনাইটেড কিংডমে থাকেন, তাহলে ডাটা কন্ট্রোলার হল Twitter ইন্টারন্যাশনাল আনলিমিটেড কোম্পানি, যার একটি ঠিকানা রয়েছে:

                    স্টার ইন্টারন্যাশনাল আনলিমিটেড কোম্পানি
                    ঢাকা, বাংলাদেশ


                    আপনি আমাদের ডেটা সুরক্ষা তদন্ত ফর্মের মাধ্যমে গোপনীয়ভাবে স্টার-এর ডেটা সুরক্ষা অফিসারের সাথে যোগাযোগ করতে পারেন৷ আপনি যদি আমাদের ডেটা প্রসেসিং অনুশীলন সম্পর্কে উদ্বেগ প্রকাশ করতে চান, তাহলে আপনার স্থানীয় তত্ত্বাবধায়ক কর্তৃপক্ষ বা স্টার ইন্টারন্যাশনাল আনলিমিটেড কোম্পানির প্রধান তত্ত্বাবধায়ক কর্তৃপক্ষ, আইরিশ ডেটা সুরক্ষা কমিশন, তাদের ওয়েবসাইটে তালিকাভুক্ত যোগাযোগের বিবরণ ব্যবহার করে তা করার অধিকার রয়েছে৷</h4>

                <p style="color:red;">
                    আমি স্টারের সকল নিময় মেনে চলি:<br>
                    ১. স্টার একটি সামাজিক যোগাযোগ মাধ্যম।<br>
                    ২. স্টার সামাজিক যোগাযোগ মাধ্যমে মেধা বিকাশে গুরুত্বপূর্ণ ভূমিকা রাখবে।<br>
                    ৩. স্টার প্রোফাইলে আপনার নিজের ছবি,সংগঠনের লোগো এবং প্রতিষ্ঠানের পতাকা ব্যবহার করুন।<br>
                    ৪. স্টার পোস্টগুলো আধুনিক এবং সৃজনশীলতা সৃষ্টির কথা বলে।<br>
                    ৫. স্টারের কোনো পোস্ট মানুষের উপকারে আসবে আধুনিক এবং সৃজনশীলতা পোস্ট করা।।<br>
                    ৬. স্টার ইসলামিক কার্যকলাপের বিরোধী এবং অন্য ধর্ম বিরোধী পোস্ট থেকে বিরত থাকা।<br>
                    ৭. স্টার মানুষের চারিত্রিক গুণাবলী ও বৈশিষ্ট্যগুলোকে গুরুত্ব দেয়। এজন্যই অন্য স্টারকে চারিত্রিক গুণাবলীতে আঘাত না করা। <br>
                    ৮. স্টার মানুষের মধ্যে এক্যবদ্ধ ও সমাজবদ্ধ করতে শেখায়।<br><br>
                    স্টার সামাজিক যোগাযোগ মাধ্যমে মেধা বিকাশে গুরুত্বপূর্ণ ভূমিকা রাখবে।
                    স্টার চালানোর নিয়ম:<br>
                    ১. স্টার প্রোফাইলে আপনার নিজের ছবি,সংগঠনের লোগো এবং প্রতিষ্ঠানের পতাকা ব্যবহার করুন।<br>
                    ২. <br>
                    ৩. <br>

                    স্টারের সাথে চলি, বিশ্বটাকে ঘুরে দেখি।<br>

                </p>
               
                <p style="color:red;">
                স্টার সামাজিক যোগাযোগ মাধ্যমের সাথে অন্য সামাজিক যোগাযোগ মাধ্যমের পার্থক্য:<br>
            ১. অন্য সামাজিক মাধ্যমগুলো অশ্লীন ছবি ব্যবহারকারী বিভিন্ন পোস্ট বা লেখা ব্যবহার করে।
            যা নিয়ান্ত্রনে নেয়া খুব কঠিন। আমরা এইগুলো খুব সহজে মোকাবেলা করবো। কিভাবে,একজন ব্যবহারকারী রিপোট করার সাথে স্টার 
            এই ব্যবহারকারী আইডি গোপনীয় নীতি লঙ্ঘন হলে বাতিল কর দিবে।<br>
            ২. অন্য সামাজিক মাধ্যমগুলো ব্যবহারকারী বিভিন্ন পোস্ট বা লেখা ভালো বা খারাপ পোস্ট বা লেখা দিকে গুরুত্ব দেয়না। কিন্তু স্টার এগুলো গুরুত্বপূর্ণ করে তুলে। কিন্তু 
            কিভাবে, স্টার প্রোগ্রামগুলো এইভাবে সাজানো যেন স্টার পোস্ট বা লেখা গুরুত্বপূর্ণ হয়ে উঠে।<br>
            ৩. অন্য সামাজিক মাধ্যমগুলো ব্যবহারকারী সামাজিক মাধ্যম হলেও সমাজের সকল নিয়ম মানতে পারেন৷। স্টার প্রোগ্রামগুলো সাজানো  হয়েছে সমাজ এবং পরিবারের 
            পরোস্পারিক সম্পক বৃদ্ধি করে। ব্যবহারকারী সমাজ এবং পরিবারের মধ্যে ভালো সম্পক তৈরি করে। সমাজের প্রতিটি মানুষের ভ্রাতৃত্ত জ্ঞান জাগ্রত করে,ব্যবহারকারীদের মাধ্যমে ।<br>
            ৪. অন্য সামাজিক মাধ্যমগুলো ব্যবহারকারী কোন ধর্মের প্রতি গুরুত্ব দেয় না। স্টার সকল ধর্মের প্রতি সম্মান ও শ্রদ্ধা রেখে ব্যবহারকারীকে গোপনীয় নীতি লঙ্ঘন হলে ব্যবহারকারীর অ্যাকাউন্টটি
             বাতিল কর দিয়।<br>
             ৫. অন্য সামাজিক মাধ্যমগুলো ব্যবহারকারী ও 

                </p>
            </div>
</body>

</html>
