<?php 

include"classes/autoload.php";

$login = new Login();
$user_data = $login->check_login($_SESSION['star_userid']);

$USER = $user_data;

if(isset($_GET['id']) && is_numeric($_GET['id'])){

    $profile = new Profile();
    $profile_data = $profile->get_profile($_GET['id']);

   if(is_array($profile_data)){
    $user_data = $profile_data[0];
  }
}

?>

<!DOCTYPE html>
<html>
<html lang="bn">
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">

<head>
    <title>Terms and conditions || Star</title>
    <style>
        #bar {
            height: 100px;
            background-color: #16b000;
            color: #fff;
            padding: 4px;
            padding-right: 425px;
            border-radius: 4px;
        }

        #button {
            background-color: #5bd043;
            width: 70px;
            text-align: center;
            padding: 4px;
            border-radius: 30px;
            float: right;
        }

        #bar2 {
            background-color: #e9ebee;
            height: 1000px;
            margin-top: 10px;
            padding: 10px;
            text-align: center;
            font-weight: bold;
            border-radius: 4px;
        }

    </style>
</head>

<body style="font-family: times new roman; background-image: url(images/img.jpg);">
    <div id="bar">
        <div style="font-size: 40px;padding-left: 421px;" style="font-family: times new roman;"><a href="login.php" style="text-decoration: none; color:white;">Star</a></div>
        <a href="index.php">
            <input type="submit" id="button" value="Back to Star" style="font-family: times new roman;width: 100px;">
        </a>
    </div>
    <div id="bar2">
        <div style="background-color: #d0d8e4; padding-left:60px; padding-top:60px;">
            <div style=" text-align: left;">
                <h2 style="text-align: center;font-family: nikosh;">স্টার শর্তাবলী</h2>
                স্টার একটি সামাজিক যোগাযোগ মাধ্যম। স্টার পরিষেবার শর্তাদি ("শর্তাবলী") ব্যবহারকারী চুক্তির অংশ- আপনার স্টার ব্যবহার নিয়ন্ত্রণ করে একটি আইনত বাধ্যতামূলক চুক্তি৷ আপনার এই পরিষেবার শর্তাদি ("শর্তাবলী") সম্পূর্ণ পড়া উচিত, তবে এখানে কয়েকটি মূল বিষয় রয়েছে যা আপনার জানা উচিত যেমন:<br><br>

                ১. আপনি প্ল্যাটফর্মে বিজ্ঞাপন দেখতে পাবেন: পরিষেবাগুলি অ্যাক্সেস করার বিনিময়ে, স্টার এবং আমাদের তৃতীয়-পক্ষ প্রদানকারী এবং অংশীদাররা আপনাকে বিজ্ঞাপন প্রদর্শন করতে পারে।<br><br>

                ২. বিষয়বস্তু পোস্ট করার সময় এবং অন্যথায় পরিষেবাগুলি ব্যবহার করার সময়, আপনাকে অবশ্যই এই ব্যবহারকারী চুক্তি এবং প্রযোজ্য আইন মেনে চলতে হবে: আপনি আপনার পরিষেবা এবং আপনার সামগ্রী ব্যবহারের জন্য দায়ী৷ আপনাকে অবশ্যই এই ব্যবহারকারী চুক্তি, এর অন্তর্নিহিত নীতি এবং সমস্ত প্রযোজ্য আইন মেনে চলতে হবে।<br><br>

                ৩. আপনাকে অবশ্যই পরিষেবাগুলির গ্রহণযোগ্য ব্যবহারের শর্তাবলী মেনে চলতে হবে: আপনি বর্তমানে উপলব্ধ, প্রকাশিত ইন্টারফেসগুলি যা আমরা প্রদান করি তা ছাড়া অন্য কোনও উপায়ে পরিষেবাগুলি অ্যাক্সেস করতে পারবেন না৷ উদাহরণস্বরূপ, এর মানে হল যে আপনি পরিষেবাগুলিকে স্ক্র্যাপ করতে পারবেন না, আমাদের আরোপ করা কোনও প্রযুক্তিগত সীমাবদ্ধতার কাছাকাছি কাজ করার চেষ্টা করুন, বা অন্যথায় পরিষেবাগুলির ক্রিয়াকলাপকে ব্যাহত করার চেষ্টা করুন৷<br><br>

                ৪. আমাদের বিস্তৃত প্রয়োগের অধিকার রয়েছে: আপনি যদি এই শর্তাদি লঙ্ঘন করেন, যেমন, আপনার বিষয়বস্তু সরানো, দৃশ্যমানতা সীমিত করা, স্টার-তে আপনার অ্যাক্সেস বন্ধ করা বা আইনি পদক্ষেপ নেওয়ার মতো, যদি আপনি এই শর্তাবলী লঙ্ঘন করেন তবে স্টার আপনার বিরুদ্ধে প্রয়োগকারী পদক্ষেপ নেওয়ার অধিকার সংরক্ষণ করে। আমরা অন্যান্য কারণে আপনার অ্যাকাউন্ট স্থগিত বা বন্ধ করতে পারি, যেমন দীর্ঘস্থায়ী নিষ্ক্রিয়তা, আইনি এক্সপোজারের ঝুঁকি, বা বাণিজ্যিক অযোগ্যতা।<br><br>

                ৫. এই শর্তাবলীতে বুদ্ধিবৃত্তিক সম্পত্তির লাইসেন্স রয়েছে: আপনি আপনার পোস্ট বা ভাগ করা আপনার যে কোনো সামগ্রীর মালিকানা এবং অধিকার বজায় রাখেন এবং আপনি আমাদেরকে একটি বিস্তৃত, রয়্যালটি-মুক্ত লাইসেন্স প্রদান করেন যাতে আপনার সামগ্রী বিশ্বের বাকিদের কাছে উপলব্ধ করা যায় এবং অন্যরা একই কাজ করে। বিপরীতভাবে, আমরা আপনাকে পরিষেবাগুলির অংশ হিসাবে যে সফ্টওয়্যার সরবরাহ করি তা ব্যবহার করার জন্য একটি লাইসেন্স প্রদান করি, যেমন স্টার মোবাইল অ্যাপ্লিকেশন, শুধুমাত্র আপনাকে পরিষেবাগুলি ব্যবহার করতে এবং উপভোগ করতে সক্ষম করার উদ্দেশ্যে৷<br><br>

                ৬. আপনার পরিষেবাগুলির ব্যবহার আপনার নিজের ঝুঁকিতে: আমরা "যেমন আছে" এবং "যেমন উপলব্ধ" ভিত্তিতে পরিষেবাগুলি সরবরাহ করি এবং আমরা আইন দ্বারা অনুমোদিত পরিমাণে আপনার বা অন্যদের কাছে সমস্ত ওয়ারেন্টি, দায়িত্ব এবং দায় অস্বীকার করি৷ আপনি অন্য ব্যবহারকারীদের দ্বারা পোস্ট করা আপত্তিকর বা ক্ষতিকারক সামগ্রীর সংস্পর্শে আসতে পারেন। পরিষেবাগুলি সময়ে সময়ে পরিবর্তিত হতে পারে, এবং আমরা যেকোন সময় আপনার বা অন্যান্য ব্যবহারকারীদের জন্য পরিষেবা বা বিশেষ বৈশিষ্ট্যগুলির প্রাপ্যতা সীমিত বা বন্ধ করতে পারি৷<br><br>

                ৭. আপনার কাছে প্রতিকার এবং প্রতিকারের ব্যবস্থা রয়েছে, কিন্তু আমাদের দায়বদ্ধতা সীমিত: আপনার অ্যাকাউন্ট নিষ্ক্রিয় করে এবং পরিষেবাগুলির ব্যবহার বন্ধ করে যে কোনও সময় এই চুক্তিটি বাতিল করার অধিকার আপনার রয়েছে। নোট করুন যে চুক্তিতে বর্ণিত নির্দিষ্ট ধরণের ক্ষতির জন্য আমরা দায়বদ্ধ থাকব না৷ আরও, যদি আপনি বিশ্বাস করেন যে আপনার বিষয়বস্তু এমনভাবে অনুলিপি করা হয়েছে যা কপিরাইট লঙ্ঘন গঠন করে, প্রতিবেদনের প্রক্রিয়াটি এই শর্তাবলীতে বিস্তারিত আছে।

                অনুগ্রহ করে আরও মনে রাখবেন যে এই শর্তাবলী আমাদের গোপনীয়তা নীতি (https:/star.com/privacy_policy) এবং সেইসাথে আপনার পরিষেবা এবং আপনার সামগ্রীর ব্যবহারে প্রযোজ্য অন্যান্য শর্তাদি অন্তর্ভুক্ত করে৷ অবশেষে, আপনি কোথায় থাকেন তার উপর নির্ভর করে এই শর্তাদি পরিবর্তিত হতে পারে, তবে যে কোনো ক্ষেত্রে, স্টার ব্যবহার করার জন্য আপনার বয়স কমপক্ষে ১৫ বছর হতে হবে।
                <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<!--
                <h2>
                    X পরিষেবার শর্তাবলী
                    আপনি যদি ইউরোপীয় ইউনিয়ন, ইএফটিএ স্টেটস বা যুক্তরাজ্যের বাইরে থাকেন, যদি আপনি মার্কিন যুক্তরাষ্ট্রে থাকেন
                    এই পরিষেবার শর্তাবলী ("শর্তাবলী") আমাদের বিভিন্ন ওয়েবসাইট, এসএমএস, API, ইমেল বিজ্ঞপ্তি, অ্যাপ্লিকেশন, বোতাম, উইজেট, বিজ্ঞাপন, বাণিজ্য পরিষেবা এবং আমাদের অন্যান্য কভার পরিষেবাগুলি সহ আমাদের পরিষেবাগুলিতে আপনার অ্যাক্সেস এবং ব্যবহার নিয়ন্ত্রণ করে (https: //help.x.com/rules-and-policies/x-services-and-corporate-affiliates) যেগুলি এই শর্তগুলির সাথে লিঙ্ক করে (সম্মিলিতভাবে, "পরিষেবা"), এবং যেকোনো তথ্য, পাঠ্য, লিঙ্ক, গ্রাফিক্স, ফটো, অডিও, ভিডিও, বা অন্যান্য উপকরণ বা সামগ্রীর ব্যবস্থা আপলোড করা, ডাউনলোড করা বা পরিষেবাগুলিতে উপস্থিত হওয়া (সম্মিলিতভাবে "সামগ্রী" হিসাবে উল্লেখ করা হয়)। পরিষেবাগুলি ব্যবহার করে আপনি এই শর্তাবলী দ্বারা আবদ্ধ হতে সম্মত হন৷

                    এই শর্তাদি আপনার এবং X কর্পোরেশনের মধ্যে একটি চুক্তি, যা X এবং পরিষেবা প্রদান করে, 1355 Market Street, Suite 900, San Francisco, CA 94103 U.S.A. শব্দ "আমরা," "আমাদের" এবং "আমাদের" মানে X কর্পোরেশন।
                </h2>
                <h2>
                    1. কারা পরিষেবাগুলি ব্যবহার করতে পারে৷
                    আপনি শুধুমাত্র তখনই পরিষেবাগুলি ব্যবহার করতে পারেন যদি আপনি আমাদের সাথে একটি বাধ্যতামূলক চুক্তি তৈরি করতে সম্মত হন এবং প্রযোজ্য এখতিয়ারের আইনের অধীনে পরিষেবাগুলি পেতে বাধাপ্রাপ্ত ব্যক্তি নন৷ যে কোনো ক্ষেত্রে, পরিষেবাগুলি ব্যবহার করার জন্য আপনার বয়স কমপক্ষে 13 বছর হতে হবে৷ আপনি যদি এই শর্তাদি স্বীকার করেন এবং কোনও কোম্পানি, সংস্থা, সরকার বা অন্য আইনি সত্তার হয়ে পরিষেবাগুলি ব্যবহার করেন, তাহলে আপনি প্রতিনিধিত্ব করেন এবং ওয়ারেন্টি দেন যে আপনি এটি করার জন্য অনুমোদিত এবং এই শর্তাবলীতে এই ধরনের সত্তাকে আবদ্ধ করার ক্ষমতা আপনার আছে, যাতে এই শর্তাবলীতে ব্যবহৃত "আপনি" এবং "আপনার" শব্দগুলি এই ধরনের সত্তাকে নির্দেশ করবে।


                    2. গোপনীয়তা
                    আমাদের গোপনীয়তা নীতি (https://www.x.com/privacy) বর্ণনা করে যে আপনি যখন পরিষেবাগুলি ব্যবহার করেন তখন আপনার দেওয়া তথ্যগুলি আমরা কীভাবে পরিচালনা করি৷ আপনি বোঝেন যে আপনার পরিষেবাগুলির ব্যবহারের মাধ্যমে আপনি এই তথ্যের সংগ্রহ এবং ব্যবহারে সম্মতি দিচ্ছেন (গোপনীয়তা নীতিতে বর্ণিত), এই তথ্যটি মার্কিন যুক্তরাষ্ট্র, আয়ারল্যান্ড এবং/অথবা স্টোরেজের জন্য অন্যান্য দেশে স্থানান্তর সহ, প্রক্রিয়াকরণ এবং আমাদের এবং আমাদের সহযোগীদের দ্বারা ব্যবহার.


                    3. পরিষেবার বিষয়বস্তু
                    প্রযোজ্য আইন, বিধি এবং প্রবিধানের সাথে সম্মতি সহ আপনার পরিষেবাগুলির ব্যবহার এবং আপনার প্রদান করা যেকোনো সামগ্রীর জন্য আপনি দায়ী৷ আপনার শুধুমাত্র এমন সামগ্রী প্রদান করা উচিত যা আপনি অন্যদের সাথে ভাগ করতে স্বাচ্ছন্দ্যবোধ করেন৷
                    পরিষেবাগুলির মাধ্যমে পোস্ট করা বা পরিষেবাগুলির মাধ্যমে আপনার দ্বারা প্রাপ্ত কোনও সামগ্রী বা উপকরণের উপর কোনও ব্যবহার বা নির্ভরতা আপনার নিজের ঝুঁকিতে৷ আমরা পরিষেবাগুলির মাধ্যমে পোস্ট করা কোনও বিষয়বস্তু বা যোগাযোগের সম্পূর্ণতা, সত্যতা, নির্ভুলতা বা নির্ভরযোগ্যতার সমর্থন, সমর্থন, প্রতিনিধিত্ব বা গ্যারান্টি দিই না বা পরিষেবাগুলির মাধ্যমে প্রকাশিত কোনও মতামতকে সমর্থন করি না। আপনি বোঝেন যে পরিষেবাগুলি ব্যবহার করার মাধ্যমে, আপনি এমন সামগ্রীর সংস্পর্শে আসতে পারেন যা আপত্তিকর, ক্ষতিকারক, ভুল বা অন্যথায় অনুপযুক্ত হতে পারে, বা কিছু ক্ষেত্রে, পোস্টিং যা ভুল লেবেল করা হয়েছে বা অন্যথায় প্রতারণামূলক। সমস্ত বিষয়বস্তু এই ধরনের বিষয়বস্তু উদ্ভূত ব্যক্তির একমাত্র দায়িত্ব। আমরা পরিষেবাগুলির মাধ্যমে পোস্ট করা বিষয়বস্তু নিরীক্ষণ বা নিয়ন্ত্রণ করতে পারি না এবং আমরা এই ধরনের সামগ্রীর জন্য দায়িত্ব নিতে পারি না।

                    আমরা ব্যবহারকারী চুক্তি লঙ্ঘন করে এমন সামগ্রী অপসারণের অধিকার সংরক্ষণ করি, উদাহরণস্বরূপ, কপিরাইট বা ট্রেডমার্ক লঙ্ঘন বা অন্যান্য বৌদ্ধিক সম্পত্তি অপপ্রয়োগ, ছদ্মবেশ, বেআইনি আচরণ, বা হয়রানি সহ। সুনির্দিষ্ট নীতি সম্পর্কিত তথ্য এবং লঙ্ঘনের প্রতিবেদন বা আবেদন করার প্রক্রিয়া আমাদের সহায়তা কেন্দ্রে পাওয়া যাবে (https://help.x.com/rules-and-policies/x-report-violation#specific-violations এবং https:// help.x.com/managing-your-account/suspended-x-accounts)।

                    আপনি যদি বিশ্বাস করেন যে আপনার সামগ্রী এমনভাবে অনুলিপি করা হয়েছে যা কপিরাইট লঙ্ঘন গঠন করে, অনুগ্রহ করে আমাদের কপিরাইট রিপোর্টিং ফর্ম (https://help.x.com/forms/dmca) পরিদর্শন করে বা এখানে আমাদের মনোনীত কপিরাইট এজেন্টের সাথে যোগাযোগ করে রিপোর্ট করুন:

                    এক্স কর্পোরেশন
                    Attn: কপিরাইট এজেন্ট
                    1355 মার্কেট স্ট্রিট, স্যুট 900
                    সান ফ্রান্সিসকো, CA 94103
                    প্রতিবেদন: https://help.x.com/forms/dmca
                    ইমেইল: copyright@x.com

                    বিষয়বস্তুতে আপনার অধিকার এবং অধিকার প্রদান
                    পরিষেবাগুলিতে বা এর মাধ্যমে আপনি যে কোনও সামগ্রী জমা দেন, পোস্ট করেন বা প্রদর্শন করেন তার উপর আপনি আপনার অধিকার বজায় রাখেন। আপনার যা আপনার তা আপনারই — আপনি আপনার সামগ্রীর মালিক (এবং আপনার অন্তর্ভুক্ত অডিও, ফটো এবং ভিডিওগুলি সামগ্রীর অংশ হিসাবে বিবেচিত হয়)৷
                    পরিষেবাগুলিতে বা এর মাধ্যমে সামগ্রী জমা দেওয়ার, পোস্ট করার বা প্রদর্শন করার মাধ্যমে, আপনি আমাদের ব্যবহার, অনুলিপি, পুনরুত্পাদন, প্রক্রিয়া, অভিযোজন, পরিবর্তন, প্রকাশ, প্রেরণের জন্য একটি বিশ্বব্যাপী, অ-এক্সক্লুসিভ, রয়্যালটি-মুক্ত লাইসেন্স (সাবলাইসেন্সের অধিকার সহ) প্রদান করেন। , এখন পরিচিত বা পরে বিকশিত যে কোনো এবং সমস্ত মিডিয়া বা বিতরণ পদ্ধতিতে এই ধরনের সামগ্রী প্রদর্শন এবং বিতরণ করুন (স্বচ্ছতার জন্য, এই অধিকারগুলি অন্তর্ভুক্ত, উদাহরণস্বরূপ, কিউরেটিং, রূপান্তর এবং অনুবাদ)। এই লাইসেন্সটি আমাদেরকে আপনার বিষয়বস্তু বিশ্বের বাকি অংশে উপলব্ধ করতে এবং অন্যদেরও একই কাজ করতে দেওয়ার অনুমতি দেয়৷ আপনি সম্মত হন যে এই লাইসেন্সের মধ্যে আমাদের পরিষেবাগুলি প্রদান, প্রচার এবং উন্নত করার অধিকার অন্তর্ভুক্ত রয়েছে এবং সিন্ডিকেশন, সম্প্রচার, বিতরণ, পুনঃপোস্ট, প্রচার বা প্রকাশনার জন্য অন্যান্য কোম্পানি, সংস্থা বা ব্যক্তিদের কাছে উপলব্ধ পরিষেবাগুলিতে বা এর মাধ্যমে জমা দেওয়া সামগ্রী তৈরি করার অধিকার রয়েছে৷ অন্যান্য মিডিয়া এবং পরিষেবাগুলিতে এই ধরনের বিষয়বস্তুর, এই ধরনের সামগ্রী ব্যবহারের জন্য আমাদের শর্তাবলী সাপেক্ষে। আমাদের, বা অন্যান্য কোম্পানি, সংস্থা বা ব্যক্তিদের দ্বারা এই ধরনের অতিরিক্ত ব্যবহারগুলি, আপনি যে সামগ্রী জমা দেন, পোস্ট করেন, প্রেরণ করেন বা অন্যথায় পরিষেবাগুলির মাধ্যমে উপলব্ধ করেন সেই বিষয়বস্তুর ক্ষেত্রে আপনাকে কোনও ক্ষতিপূরণ প্রদান না করেই করা হয় কারণ আপনার দ্বারা পরিষেবাগুলি ব্যবহার করা হয়৷ এতদ্বারা বিষয়বস্তু এবং এখানে অধিকার প্রদানের জন্য যথেষ্ট ক্ষতিপূরণ হিসাবে সম্মত।

                    বাস্তুতন্ত্রের অংশীদাররা কীভাবে পরিষেবাগুলিতে আপনার সামগ্রীর সাথে ইন্টারঅ্যাক্ট করতে পারে তার জন্য আমাদের কাছে একটি বিবর্তিত নিয়ম রয়েছে৷ এই নিয়মগুলি আপনার অধিকারকে মাথায় রেখে একটি উন্মুক্ত বাস্তুতন্ত্রকে সক্ষম করার জন্য বিদ্যমান। আপনি বোঝেন যে আমরা আপনার বিষয়বস্তু পরিবর্তন বা মানিয়ে নিতে পারি কারণ এটি আমাদের এবং আমাদের অংশীদারদের দ্বারা বিতরণ করা, সিন্ডিকেট করা, প্রকাশিত বা সম্প্রচার করা হয়েছে এবং/অথবা বিভিন্ন মিডিয়াতে বিষয়বস্তুকে মানিয়ে নেওয়ার জন্য আপনার সামগ্রীতে পরিবর্তন করতে পারি৷
                </h2>
                <h2>আপনি প্রতিনিধিত্ব করেন এবং ওয়ারেন্টি দেন যে আপনার কাছে বা পরিষেবাগুলিতে বা এর মাধ্যমে জমা দেওয়া, পোস্ট করা বা প্রদর্শন করা যেকোন সামগ্রীর জন্য এখানে প্রদত্ত অধিকারগুলি মঞ্জুর করার জন্য প্রয়োজনীয় সমস্ত অধিকার, লাইসেন্স, সম্মতি, অনুমতি, ক্ষমতা এবং/অথবা আপনার কাছে রয়েছে বা প্রাপ্ত হয়েছে৷ আপনি সম্মত হন যে এই ধরনের বিষয়বস্তুতে কপিরাইট বা অন্যান্য মালিকানার অধিকারের বিষয়বস্তু থাকবে না, যদি না আপনার প্রয়োজনীয় অনুমতি থাকে বা অন্যথায় বিষয়বস্তু পোস্ট করার এবং আমাদের উপরে বর্ণিত লাইসেন্স দেওয়ার জন্য আইনত অধিকার না থাকে।


                    4. পরিষেবাগুলি ব্যবহার করা৷
                    দয়া করে আমাদের নিয়ম ও নীতিগুলি পর্যালোচনা করুন, যা ব্যবহারকারী চুক্তির অংশ এবং পরিষেবাগুলিতে নিষিদ্ধ আচরণের রূপরেখা। আপনি শুধুমাত্র এই শর্তাবলী এবং সমস্ত প্রযোজ্য আইন, নিয়ম এবং প্রবিধান মেনে পরিষেবাগুলি ব্যবহার করতে পারেন৷ X যখন বিষয়বস্তু বা ব্যবহারকারীর আচরণ আমাদের নিয়ম ও নীতি লঙ্ঘন করে বা সংবেদনশীল মিডিয়ার সাথে সম্পর্কিত হয় তখন প্রয়োগকারী পদক্ষেপ নেয়। আপনি X এর প্রয়োগের বিকল্পগুলি পর্যালোচনা করতে পারেন এবং কীভাবে আপনি এখানে আমাদের প্রয়োগকারী সিদ্ধান্তের আবেদন করতে পারেন।

                    পরিষেবাগুলি ক্রমাগত বিকশিত হয়। যেমন, পরিষেবাগুলি সময়ে সময়ে, আমাদের বিবেচনার ভিত্তিতে পরিবর্তিত হতে পারে৷ আমরা (স্থায়ীভাবে বা অস্থায়ীভাবে) পরিষেবাগুলি বা পরিষেবাগুলির মধ্যে যে কোনও বৈশিষ্ট্য আপনাকে বা সাধারণভাবে ব্যবহারকারীদের দেওয়া বন্ধ করতে পারি। আমরা যে কোনো সময় আমাদের নিজস্ব বিবেচনার ভিত্তিতে ব্যবহার এবং সঞ্চয়স্থানের সীমা তৈরি করার অধিকারও ধরে রাখি। আমরা পরিষেবাগুলির কোনও সামগ্রী বিতরণ করতে বা প্রত্যাখ্যান করতে পারি, পরিষেবার কোনও সামগ্রীর বিতরণ বা দৃশ্যমানতা সীমিত করতে পারি, ব্যবহারকারীদের স্থগিত বা বাতিল করতে পারি এবং আপনার কাছে দায়বদ্ধতা ছাড়াই ব্যবহারকারীর নামগুলি পুনরুদ্ধার করতে পারি৷

                    আপনাকে পরিষেবাগুলিতে অ্যাক্সেস এবং ব্যবহারের জন্য আমাদের মঞ্জুর করার বিবেচনায়, আপনি সম্মত হন যে আমরা এবং আমাদের তৃতীয়-পক্ষ প্রদানকারী এবং অংশীদাররা পরিষেবাগুলিতে বিজ্ঞাপন দিতে পারি বা পরিষেবাগুলি থেকে সামগ্রী বা তথ্য প্রদর্শনের সাথে সম্পর্কিত যে আপনি জমা দিয়েছেন বা অন্যান্য. আমরা যেকোনো তথ্য অ্যাক্সেস, পড়ার, সংরক্ষণ এবং প্রকাশ করার অধিকারও সংরক্ষণ করি কারণ আমরা যুক্তিসঙ্গতভাবে বিশ্বাস করি যে (i) কোনো প্রযোজ্য আইন, প্রবিধান, আইনি প্রক্রিয়া বা সরকারী অনুরোধ সন্তুষ্ট করার জন্য, (ii) সম্ভাব্য তদন্ত সহ শর্তাদি প্রয়োগ করা এর লঙ্ঘন, (iii) জালিয়াতি, নিরাপত্তা বা প্রযুক্তিগত সমস্যাগুলি সনাক্ত করা, প্রতিরোধ করা বা অন্যথায় সমাধান করা, (iv) ব্যবহারকারীর সহায়তার অনুরোধে সাড়া দেওয়া, বা (v) X, এর ব্যবহারকারীদের এবং জনসাধারণের অধিকার, সম্পত্তি বা নিরাপত্তা রক্ষা করা। আমরা আমাদের গোপনীয়তা নীতি ব্যতীত তৃতীয় পক্ষের কাছে ব্যক্তিগতভাবে সনাক্তকারী তথ্য প্রকাশ করি না।

                    X-এ কিছু পরিষেবা বা বৈশিষ্ট্য অফার করা হতে পারে যার জন্য আপনার সেই পরিষেবাগুলির ব্যবহারের সাথে সম্পর্কিত অতিরিক্ত শর্তাবলী প্রযোজ্য হতে পারে। এই অতিরিক্ত পরিষেবাগুলির যেকোনো একটি ব্যবহার করে বা অর্থপ্রদান করে, আপনি সেই পরিষেবাগুলির জন্য প্রযোজ্য যেকোন অতিরিক্ত শর্তাবলীতে সম্মত হন এবং সেই অতিরিক্ত শর্তাবলী আপনার সাথে আমাদের চুক্তির অংশ হয়ে ওঠে। প্রযোজ্য অতিরিক্ত শর্তাবলীর যেকোনও যদি এই শর্তাবলীর সাথে সাংঘর্ষিক হয়, তাহলে অতিরিক্ত শর্তাবলী প্রাধান্য পাবে যখন আপনি সেই পরিষেবাগুলি ব্যবহার করছেন যেখানে তারা প্রযোজ্য হবে।

                    আপনি যদি পরিষেবাগুলির অর্থপ্রদানের বৈশিষ্ট্যগুলি ব্যবহার করেন, আপনি প্রদত্ত পরিষেবাগুলির জন্য প্রযোজ্য শর্তাবলীতে সম্মত হন (https://legal.x.com/purchaser-terms.html)৷

                    আপনি যদি পরিষেবাগুলির বিকাশকারী বৈশিষ্ট্যগুলি ব্যবহার করেন, যার মধ্যে রয়েছে কিন্তু সীমাবদ্ধ নয় X for Websites (https://developer.x.com/docs/twitter-for-websites), X কার্ডগুলি (https://developer.x.com/ docs/twitter-for-websites/cards/overview/abouts-cards), পাবলিক API (https://developer.x.com/docs), অথবা X (https://developer.x.com/docs) দিয়ে সাইন ইন করুন /authentication/guides/log-in-with-twitter), আপনি আমাদের বিকাশকারী চুক্তি (https://developer.x.com/developer-terms/agreement) এবং বিকাশকারী নীতিতে সম্মত হন (https://developer.x.com) /বিকাশকারী শর্তাবলী/নীতি)। আপনি যদি পুনরুত্পাদন, পরিবর্তন, ডেরিভেটিভ কাজ তৈরি করতে, বিতরণ, বিক্রয়, স্থানান্তর, সর্বজনীনভাবে প্রদর্শন, সর্বজনীনভাবে সঞ্চালন, প্রেরণ, বা অন্যথায় পরিষেবাগুলিতে পরিষেবা বা বিষয়বস্তু ব্যবহার করতে চান, তাহলে আপনাকে অনুমতি ছাড়া আমাদের দেওয়া ইন্টারফেস এবং নির্দেশাবলী ব্যবহার করতে হবে পরিষেবা, এই শর্তাবলী বা https://developer.x.com/developer-terms-এ প্রদত্ত শর্তাবলীর মাধ্যমে। অন্যথায়, এই ধরনের সমস্ত কর্ম কঠোরভাবে নিষিদ্ধ করা হয়. আপনি যদি একজন নিরাপত্তা গবেষক হন, তাহলে আপনাকে আমাদের দুর্বলতা রিপোর্টিং প্রোগ্রামের (https://hackerone.com/x) নিয়ম মেনে চলতে হবে। পূর্ববর্তী অনুচ্ছেদে নির্ধারিত প্রয়োজনীয়তাগুলি আমাদের দুর্বলতা রিপোর্টিং প্রোগ্রামে অংশগ্রহণকারীদের জন্য প্রযোজ্য নাও হতে পারে।

                    আপনি যদি পরিষেবাগুলির বিজ্ঞাপন বৈশিষ্ট্যগুলি ব্যবহার করেন তবে আপনি আমাদের মাস্টার পরিষেবা চুক্তিতে সম্মত হন (https://ads.x.com/terms)৷

                    আপনার অ্যাকাউন্ট
                    পরিষেবাগুলি ব্যবহার করার জন্য আপনাকে একটি অ্যাকাউন্ট তৈরি করতে হতে পারে৷ আপনি আপনার অ্যাকাউন্ট সুরক্ষিত করার জন্য দায়ী, তাই একটি শক্তিশালী পাসওয়ার্ড ব্যবহার করুন এবং এই অ্যাকাউন্টে এর ব্যবহার সীমিত করুন। আমরা উপরোক্ত মেনে চলতে আপনার ব্যর্থতা থেকে উদ্ভূত কোনো ক্ষতি বা ক্ষতির জন্য দায়ী হতে পারি না এবং হবে না।
                </h2>
                <h2>আপনি পরিষেবাগুলি থেকে বেশিরভাগ যোগাযোগ নিয়ন্ত্রণ করতে পারেন৷ আমাদের আপনাকে কিছু নির্দিষ্ট যোগাযোগ প্রদান করতে হতে পারে, যেমন পরিষেবার ঘোষণা এবং প্রশাসনিক বার্তা। এই যোগাযোগগুলি পরিষেবা এবং আপনার অ্যাকাউন্টের অংশ হিসাবে বিবেচিত হয় এবং আপনি সেগুলি গ্রহণ করা থেকে অপ্ট-আউট করতে সক্ষম নাও হতে পারেন৷ আপনি যদি আপনার অ্যাকাউন্টে আপনার ফোন নম্বর যোগ করেন এবং আপনি পরে সেই ফোন নম্বরটি পরিবর্তন বা নিষ্ক্রিয় করেন, তাহলে আপনাকে অবশ্যই আপনার অ্যাকাউন্টের তথ্য আপডেট করতে হবে যাতে আমরা আপনার পুরানো নম্বরটি অর্জন করে এমন কারও সাথে যোগাযোগ করতে না পারা।

                    পরিষেবাগুলি ব্যবহার করার জন্য আপনার লাইসেন্স৷
                    পরিষেবার অংশ হিসাবে আপনাকে প্রদত্ত সফ্টওয়্যার ব্যবহার করার জন্য আমরা আপনাকে একটি ব্যক্তিগত, বিশ্বব্যাপী, রয়্যালটি-মুক্ত, অ-অর্পণযোগ্য এবং নন-এক্সক্লুসিভ লাইসেন্স দিই। এই শর্তাবলী দ্বারা অনুমোদিত পদ্ধতিতে, X এ প্রদত্ত পরিষেবাগুলির সুবিধাগুলি ব্যবহার করতে এবং উপভোগ করতে আপনাকে সক্ষম করা এই লাইসেন্সের একমাত্র উদ্দেশ্য।

                    পরিষেবাগুলি কপিরাইট, ট্রেডমার্ক, এবং মার্কিন যুক্তরাষ্ট্র এবং অন্যান্য দেশের অন্যান্য আইন দ্বারা সুরক্ষিত। শর্তাবলীর কোন কিছুই আপনাকে X নাম বা X ট্রেডমার্ক, লোগো, ডোমেন নাম, অন্যান্য স্বতন্ত্র ব্র্যান্ড বৈশিষ্ট্য এবং অন্যান্য মালিকানা অধিকার ব্যবহার করার অধিকার দেয় না। সমস্ত অধিকার, শিরোনাম, এবং পরিষেবাগুলিতে এবং আগ্রহ (ব্যবহারকারীদের দ্বারা প্রদত্ত বিষয়বস্তু ব্যতীত) আমাদের এবং আমাদের লাইসেন্সকারীদের একচেটিয়া সম্পত্তি এবং থাকবে। X, বা পরিষেবাগুলি সম্পর্কে আপনি যে কোনও প্রতিক্রিয়া, মন্তব্য বা পরামর্শ প্রদান করতে পারেন তা সম্পূর্ণরূপে স্বেচ্ছাসেবী এবং আমরা এই ধরনের প্রতিক্রিয়া, মন্তব্য বা পরামর্শগুলি ব্যবহার করতে মুক্ত থাকব যা আমরা উপযুক্ত মনে করি এবং আপনার প্রতি কোনও বাধ্যবাধকতা ছাড়াই৷

                    পরিষেবার অপব্যবহার
                    আপনি পরিষেবাগুলির অপব্যবহার না করার বিষয়েও সম্মত হন, উদাহরণস্বরূপ, তাদের সাথে হস্তক্ষেপ করে বা ইন্টারফেস এবং আমাদের দেওয়া নির্দেশাবলী ছাড়া অন্য কোনও পদ্ধতি ব্যবহার করে সেগুলি অ্যাক্সেস করে৷ আপনি সম্মত হন যে আপনি পরিষেবার অংশ হিসাবে আপনাকে প্রদত্ত সফ্টওয়্যারটিতে কোনও প্রযুক্তিগত সীমাবদ্ধতা নিয়ে কাজ করবেন না, বা প্রযোজ্য আইন স্পষ্টভাবে অনুমতি দেয় এমন সীমা ছাড়া, সফ্টওয়্যারটিকে বিপরীত প্রকৌশলী, ডিকম্পাইল বা বিচ্ছিন্ন করবেন না। পরিষেবাগুলি অ্যাক্সেস বা ব্যবহার করার সময় আপনি নিম্নলিখিতগুলির কোনওটি নাও করতে পারেন: (i) পরিষেবাগুলির অ-পাবলিক অঞ্চলগুলি, আমাদের কম্পিউটার সিস্টেমগুলি, বা আমাদের প্রদানকারীদের প্রযুক্তিগত বিতরণ সিস্টেমগুলি অ্যাক্সেস করা, এর সাথে হস্তক্ষেপ করা বা ব্যবহার করা; (ii) কোনো সিস্টেম বা নেটওয়ার্কের দুর্বলতা যাচাই, স্ক্যান বা পরীক্ষা করা বা কোনো নিরাপত্তা বা প্রমাণীকরণ ব্যবস্থা লঙ্ঘন বা বাধা দেওয়া; (iii) আমাদের বর্তমানে উপলব্ধ, প্রকাশিত ইন্টারফেস যা আমাদের দ্বারা প্রদত্ত (এবং শুধুমাত্র প্রযোজ্য শর্তাবলী অনুসারে) ব্যতীত অন্য যেকোন উপায়ে (স্বয়ংক্রিয় বা অন্যথায়) পরিষেবাগুলি অ্যাক্সেস বা অনুসন্ধান বা অ্যাক্সেস বা অনুসন্ধান করার চেষ্টা করুন, যদি না আপনি আমাদের সাথে একটি পৃথক চুক্তিতে বিশেষভাবে এটি করার অনুমতি দেওয়া হয়েছে (দ্রষ্টব্য: আমাদের পূর্ব লিখিত সম্মতি ব্যতীত যেকোনো উদ্দেশ্যে পরিষেবাগুলিকে ক্রল করা বা স্ক্র্যাপ করা স্পষ্টভাবে নিষিদ্ধ); (iv) কোনো ইমেল বা পোস্টিং-এ কোনো TCP/IP প্যাকেট হেডার বা হেডার তথ্যের কোনো অংশ জাল করা, অথবা পরিবর্তিত, প্রতারণামূলক বা মিথ্যা উৎস-শনাক্তকারী তথ্য পাঠাতে পরিষেবাগুলি ব্যবহার করা; (v) আমাদের প্ল্যাটফর্ম ম্যানিপুলেশন এবং স্প্যাম নীতি বা অন্য কোনো নিয়ম ও নীতি লঙ্ঘন করে এমন কোনো আচরণে জড়িত হওয়া; বা (vi) কোনো ব্যবহারকারী, হোস্ট বা নেটওয়ার্কের অ্যাক্সেসে হস্তক্ষেপ বা ব্যাঘাত ঘটানো, (বা করার চেষ্টা), সীমাবদ্ধতা ছাড়াই, ভাইরাস পাঠানো, ওভারলোডিং, বন্যা, স্প্যামিং, মেল-বোমািং পরিষেবা, বা এমনভাবে বিষয়বস্তু তৈরির স্ক্রিপ্ট করে যাতে হস্তক্ষেপ করা হয় বা পরিষেবার উপর অযথা বোঝা তৈরি হয়। এই শর্তাবলী লঙ্ঘন করতে অন্যদের সুবিধা দেওয়া বা সহায়তা করাও এই শর্তাবলীর লঙ্ঘন, যার মধ্যে পণ্য বা পরিষেবাগুলি বিতরণ করা যা এই শর্তাবলী লঙ্ঘনকে সক্ষম বা উত্সাহিত করে৷

                    এই শর্তাদি শেষ করা হচ্ছে
                    আপনি আপনার অ্যাকাউন্টগুলি নিষ্ক্রিয় করে এবং পরিষেবাগুলির আপনার ব্যবহার বন্ধ করে যে কোনও সময় আমাদের সাথে আপনার আইনি চুক্তি শেষ করতে পারেন৷ কীভাবে আপনার অ্যাকাউন্ট নিষ্ক্রিয় করতে হয় তার নির্দেশাবলীর জন্য https://help.x.com/managing-your-account/how-to-deactivate-x-account দেখুন এবং আপনার তথ্যের কী হবে সে সম্পর্কে আরও তথ্যের জন্য গোপনীয়তা নীতি দেখুন৷

                    আমরা আপনার অ্যাকাউন্ট স্থগিত বা সমাপ্ত করতে পারি বা যেকোনো সময় আপনাকে পরিষেবার সমস্ত বা অংশ সরবরাহ করা বন্ধ করে দিতে পারি যদি আমরা যুক্তিসঙ্গতভাবে বিশ্বাস করি: (i) আপনি এই শর্তাবলী বা আমাদের নিয়ম ও নীতি লঙ্ঘন করেছেন, (ii) আপনি ঝুঁকি বা সম্ভাব্য আইনি এক্সপোজার তৈরি করেছেন আমাদের জন্য; (iii) বেআইনি আচরণের কারণে আপনার অ্যাকাউন্ট মুছে ফেলা উচিত; (iv) দীর্ঘস্থায়ী নিষ্ক্রিয়তার কারণে আপনার অ্যাকাউন্ট সরানো উচিত; অথবা (v) আপনার জন্য আমাদের পরিষেবার বিধান আর বাণিজ্যিকভাবে কার্যকর নয়৷
                    পরিস্থিতির উপর নির্ভর করে আমরা আপনার অ্যাকাউন্টের সাথে যুক্ত ইমেল ঠিকানার মাধ্যমে বা পরবর্তী সময়ে যখন আপনি আপনার অ্যাকাউন্ট অ্যাক্সেস করার চেষ্টা করবেন তখন আপনাকে জানানোর যুক্তিসঙ্গত প্রচেষ্টা করব। আইন দ্বারা অনুমোদিত সীমা পর্যন্ত, আমরা আপনার অ্যাকাউন্টটি বন্ধ করে দিতে পারি বা আমাদের সুবিধামত অন্য কোনো কারণে বা কোনো কারণে আপনাকে সমস্ত বা আংশিক পরিষেবা সরবরাহ করা বন্ধ করে দিতে পারি। এই ধরনের সমস্ত ক্ষেত্রে, শর্তাদি শেষ হয়ে যাবে, যার মধ্যে সীমাবদ্ধতা ছাড়াই, আপনার পরিষেবাগুলি ব্যবহার করার লাইসেন্স, ব্যতীত নিম্নলিখিত বিভাগগুলি প্রযোজ্য হবে: 2, 3, 5, 6, এবং ধারা 4 এর অপব্যবহারের বিধান ("অপব্যবহার পরিষেবাগুলির")। আপনি যদি বিশ্বাস করেন যে আপনার অ্যাকাউন্টটি ভুলবশত বন্ধ হয়ে গেছে আপনি আমাদের সহায়তা কেন্দ্রে (https://help.x.com/forms/account-access/appeals) পাওয়া পদক্ষেপগুলি অনুসরণ করে একটি আপিল দায়ের করতে পারেন৷ সন্দেহ এড়ানোর জন্য, এই শর্তাবলী আপনার অ্যাকাউন্ট নিষ্ক্রিয় বা সমাপ্তি থেকে বেঁচে থাকে।


                    5. দাবিত্যাগ এবং দায়বদ্ধতার সীমাবদ্ধতা

                    পরিষেবাগুলি "AS-IS" উপলব্ধ
                    পরিষেবা বা যেকোনো বিষয়বস্তুতে আপনার অ্যাক্সেস এবং ব্যবহার আপনার নিজের ঝুঁকিতে। আপনি বোঝেন এবং সম্মত হন যে পরিষেবাগুলি আপনাকে "যেমন আছে" এবং "যেমন উপলব্ধ" ভিত্তিতে প্রদান করা হয়৷ "এক্স সত্তা" বলতে X কর্পোরেশন, এর পিতামাতা, সহযোগী, সংশ্লিষ্ট কোম্পানি, কর্মকর্তা, পরিচালক, কর্মচারী, এজেন্ট, প্রতিনিধি, অংশীদার এবং লাইসেন্সদাতাদের বোঝায়। পূর্বোক্তগুলিকে সীমাবদ্ধ না করে, প্রযোজ্য আইনের অধীনে অনুমোদিত সর্বাধিক সীমা পর্যন্ত, X সংস্থাগুলি সমস্ত ওয়ারেন্টি এবং শর্তাবলী অস্বীকার করে, তা প্রকাশ বা উহ্য যাই হোক না কেন, একটি বিশেষ উদ্দেশ্যের জন্য ব্যবসায়িকতা, উপযুক্ততা, X সত্তাগুলি কোনও ওয়ারেন্টি বা প্রতিনিধিত্ব করে না এবং এর জন্য সমস্ত দায়িত্ব এবং দায় অস্বীকার করে: (i) পরিষেবা বা কোনও বিষয়বস্তুর সম্পূর্ণতা, নির্ভুলতা, প্রাপ্যতা, সময়োপযোগীতা, নিরাপত্তা বা নির্ভরযোগ্যতা; (ii) আপনার কম্পিউটার সিস্টেমের কোনো ক্ষতি, ডেটার ক্ষতি, বা অন্যান্য ক্ষতি যা আপনার পরিষেবা বা কোনো সামগ্রীতে অ্যাক্সেস বা ব্যবহারের ফলে; (iii) পরিষেবাগুলির দ্বারা রক্ষণাবেক্ষণ করা কোনও সামগ্রী এবং অন্যান্য যোগাযোগগুলি মুছে ফেলা বা সঞ্চয় বা প্রেরণে ব্যর্থতা; এবং (iv) পরিষেবাগুলি আপনার প্রয়োজনীয়তাগুলি পূরণ করবে বা নিরবচ্ছিন্ন, সুরক্ষিত বা ত্রুটি-মুক্ত ভিত্তিতে উপলব্ধ হবে কিনা। কোন পরামর্শ বা তথ্য, মৌখিক বা লিখিত হোক না কেন, X সত্তা থেকে বা পরিষেবাগুলির মাধ্যমে প্রাপ্ত, এখানে স্পষ্টভাবে করা হয়নি এমন কোনও ওয়ারেন্টি বা প্রতিনিধিত্ব তৈরি করবে না।

                    দায়বদ্ধতা সীমাবদ্ধতা
                    প্রযোজ্য আইন দ্বারা অনুমোদিত সর্বাধিক সীমা পর্যন্ত, X সংস্থাগুলি কোনও পরোক্ষ, আকস্মিক, বিশেষ, ফলস্বরূপ বা শাস্তিমূলক ক্ষতি, বা অপ্রয়োজনীয় ক্ষতির জন্য দায়বদ্ধ হবে না LY বা পরোক্ষভাবে, বা ডেটার কোনো ক্ষতি, ব্যবহার , সদিচ্ছা, বা অন্যান্য অস্পষ্ট ক্ষতি, যার ফলে (i) আপনার অ্যাক্সেস বা ব্যবহার বা পরিষেবাগুলি অ্যাক্সেস বা ব্যবহারে অক্ষমতা; (ii) পরিষেবাগুলিতে কোনও তৃতীয় পক্ষের কোনও আচরণ বা বিষয়বস্তু, সীমাবদ্ধতা ছাড়াই, কোনও মানহানিকর, অন্য ব্যবহারকারী বা তৃতীয় পক্ষের আপত্তিকর বা অবৈধ আচরণ সহ; (iii) পরিষেবাগুলি থেকে প্রাপ্ত কোনও সামগ্রী; অথবা (iv) অননুমোদিত অ্যাক্সেস, আপনার ট্রান্সমিশন বা বিষয়বস্তুর ব্যবহার বা পরিবর্তন। কোনো অবস্থাতেই X সত্তার সামগ্রিক দায় একশ মার্কিন ডলার (ইউ.এস. $100.00) বা আপনার দেওয়া অর্থের বেশি হবে না তিনি দাবি. এই উপধারার সীমাবদ্ধতা দায়বদ্ধতার যে কোনো তত্ত্বের জন্য প্রযোজ্য হবে, তা ওয়্যারেন্টি, চুক্তি, সংবিধি, নির্যাতনের (অবহেলা সহ) উপর ভিত্তি করে বা অন্যথায়, এবং উভয় ক্ষেত্রেই হোক বা না হোক এই ধরনের যেকোন ক্ষতির সম্ভাবনা, এবং এমনকি যদি এখানে উল্লেখিত কোনো প্রতিকার তার অপরিহার্য উদ্দেশ্য ব্যর্থ হয়েছে বলে পাওয়া যায়।


                    6. সাধারণ
                    আমরা সময়ে সময়ে এই শর্তাদি সংশোধন করতে পারি। পরিবর্তনগুলি পূর্ববর্তী হবে না, এবং শর্তাবলীর সবচেয়ে বর্তমান সংস্করণ, যা সর্বদা x.com/tos এ থাকবে, আপনার সাথে আমাদের সম্পর্ক পরিচালনা করবে৷ আমরা আপনাকে বস্তুগত সংশোধন সম্পর্কে অবহিত করার চেষ্টা করব, উদাহরণস্বরূপ একটি পরিষেবা বিজ্ঞপ্তির মাধ্যমে বা আপনার অ্যাকাউন্টের সাথে যুক্ত ইমেলে একটি ইমেল। এই সংশোধনগুলি কার্যকর হওয়ার পরে পরিষেবাগুলি অ্যাক্সেস করা বা ব্যবহার করা চালিয়ে যাওয়ার মাধ্যমে, আপনি সংশোধিত শর্তাবলী দ্বারা আবদ্ধ হতে সম্মত হন৷ আইন দ্বারা অনুমোদিত সীমা পর্যন্ত, আপনি যেকোন কথিত শ্রেণী কর্ম, সম্মিলিত ক্রিয়া বা প্রতিনিধিত্বমূলক পদক্ষেপে বাদী বা শ্রেণী সদস্য হিসাবে অংশগ্রহণের অধিকার পরিত্যাগ করেন।

                    ক্যালিফোর্নিয়া রাজ্যের আইন, তার পছন্দের আইনের বিধানগুলি বাদ দিয়ে, এই শর্তাদি এবং আপনার এবং আমাদের মধ্যে উদ্ভূত যে কোনও বিরোধকে নিয়ন্ত্রণ করবে৷ এই শর্তাবলী বা পরিষেবাগুলির সাথে সম্পর্কিত সমস্ত বিরোধ শুধুমাত্র সান ফ্রান্সিসকো কাউন্টি, ক্যালিফোর্নিয়া, মার্কিন যুক্তরাষ্ট্রে অবস্থিত ফেডারেল বা রাজ্য আদালতে আনা হবে এবং আপনি ব্যক্তিগত এখতিয়ারে সম্মত হন এবং অসুবিধাজনক ফোরামের জন্য কোনো আপত্তি পরিত্যাগ করেন। আইন দ্বারা অনুমোদিত সীমা পর্যন্ত, আপনি যে কোনও কথিত ক্লাস অ্যাকশন, সম্মিলিত ক্রিয়া বা প্রতিনিধিত্বমূলক পদক্ষেপে বাদী বা শ্রেণী সদস্য হিসাবে অংশ নেওয়ার অধিকারও পরিত্যাগ করেন।
                </h2>
                <h2>
                    ক্যালিফোর্নিয়া রাজ্যের আইন, তার পছন্দের আইনের বিধানগুলি বাদ দিয়ে, এই শর্তাদি এবং আপনার এবং আমাদের মধ্যে উদ্ভূত যে কোনও বিরোধকে নিয়ন্ত্রণ করবে৷ এই শর্তাবলী বা পরিষেবাগুলির সাথে সম্পর্কিত সমস্ত বিরোধ শুধুমাত্র সান ফ্রান্সিসকো কাউন্টি, ক্যালিফোর্নিয়া, মার্কিন যুক্তরাষ্ট্রে অবস্থিত ফেডারেল বা রাজ্য আদালতে আনা হবে এবং আপনি ব্যক্তিগত এখতিয়ারে সম্মত হন এবং অসুবিধাজনক ফোরামের জন্য কোনো আপত্তি পরিত্যাগ করেন। আইন দ্বারা অনুমোদিত সীমা পর্যন্ত, আপনি যে কোনও কথিত ক্লাস অ্যাকশন, সম্মিলিত ক্রিয়া বা প্রতিনিধিত্বমূলক পদক্ষেপে বাদী বা শ্রেণী সদস্য হিসাবে অংশ নেওয়ার অধিকারও পরিত্যাগ করেন।

                    আপনি যদি মার্কিন যুক্তরাষ্ট্রে একটি ফেডারেল, রাজ্য বা স্থানীয় সরকারী সত্তা হন আপনার অফিসিয়াল ক্ষমতায় পরিষেবাগুলি ব্যবহার করে এবং আইনতভাবে উপরে নিয়ন্ত্রণকারী আইন, এখতিয়ার বা স্থানের ধারাগুলি গ্রহণ করতে অক্ষম হন, তাহলে সেই ধারাগুলি আপনার জন্য প্রযোজ্য নয়৷ এই ধরনের মার্কিন যুক্তরাষ্ট্রের ফেডারেল সরকারের সত্তাগুলির জন্য, এই শর্তাবলী এবং এর সাথে সম্পর্কিত যে কোনও পদক্ষেপ মার্কিন যুক্তরাষ্ট্রের আইন দ্বারা পরিচালিত হবে (আইনের সংঘাতের রেফারেন্স ছাড়াই) এবং ফেডারেল আইনের অনুপস্থিতিতে এবং ফেডারেল আইনের অধীনে অনুমোদিত পরিমাণে , ক্যালিফোর্নিয়া রাজ্যের আইন (আইনের পছন্দ ব্যতীত)।

                    X ব্যবহারকারী চুক্তিটি ইংরেজিতে লেখা কিন্তু অনুবাদের মাধ্যমে একাধিক ভাষায় উপলব্ধ করা হয়েছে। X মূল ইংরেজি সংস্করণে অনুবাদগুলো যথাসম্ভব নির্ভুল করার চেষ্টা করে। যাইহোক, কোনো অসঙ্গতি বা অসঙ্গতির ক্ষেত্রে, X ব্যবহারকারী চুক্তির ইংরেজি ভাষার সংস্করণ অগ্রাধিকার পাবে। আপনি স্বীকার করেন যে X ব্যবহারকারী চুক্তির শর্তাবলী ব্যাখ্যা এবং নির্মাণের জন্য ইংরেজি হবে রেফারেন্সের ভাষা।

                    ইভেন্টে যে এই শর্তাবলীর কোনো বিধান অবৈধ বা অপ্রয়োগযোগ্য বলে ধরে নেওয়া হয়, তাহলে সেই বিধানটি প্রয়োজনীয় ন্যূনতম পরিমাণে সীমিত বা বাদ দেওয়া হবে এবং এই শর্তাবলীর অবশিষ্ট বিধানগুলি পূর্ণ বল এবং কার্যকর থাকবে৷ এই শর্তাবলীর কোনো অধিকার বা বিধান কার্যকর করতে আমাদের ব্যর্থতা এই ধরনের অধিকার বা বিধানের মওকুফ বলে গণ্য হবে না।

                    এই শর্তাবলী সম্পর্কে আপনার কোন প্রশ্ন থাকলে, আমাদের সাথে যোগাযোগ করুন.

                    কার্যকরী: সেপ্টেম্বর 29, 2023

                    পূর্ববর্তী শর্তাবলী সংরক্ষণাগার

                </h2>
-->
<!--
                
                <h2>X পরিষেবার শর্তাবলী
                    আপনি যদি ইউরোপীয় ইউনিয়ন, EFTA রাজ্য বা যুক্তরাজ্যে থাকেন
                    এই পরিষেবার শর্তাবলী ("শর্তাবলী") আমাদের বিভিন্ন ওয়েবসাইট, এসএমএস, API, ইমেল বিজ্ঞপ্তি, অ্যাপ্লিকেশন, বোতাম, উইজেট, বিজ্ঞাপন, বাণিজ্য পরিষেবা এবং আমাদের অন্যান্য কভার পরিষেবাগুলি সহ (https: //help.x.com/rules-and-policies/x-services-and-corporate-affiliates) যেগুলি এই শর্তগুলির সাথে লিঙ্ক করে (সম্মিলিতভাবে, "পরিষেবা"), এবং যেকোনো তথ্য, পাঠ্য, লিঙ্ক, গ্রাফিক্স, ফটো, অডিও, ভিডিও, বা অন্যান্য উপকরণ বা সামগ্রীর ব্যবস্থা আপলোড করা, ডাউনলোড করা বা পরিষেবাগুলিতে উপস্থিত হওয়া (সম্মিলিতভাবে "সামগ্রী" হিসাবে উল্লেখ করা হয়)। পরিষেবাগুলি ব্যবহার করে আপনি এই শর্তাবলী দ্বারা আবদ্ধ হতে সম্মত হন৷

                    এই শর্তাদি আপনার এবং Twitter ইন্টারন্যাশনাল আনলিমিটেড কোম্পানির মধ্যে একটি চুক্তি (Co. number 503351, VAT number IE9803175Q), একটি আইরিশ কোম্পানি, যেটি X এবং পরিষেবা প্রদান করে, যার রেজিস্টার্ড অফিস ওয়ান কাম্বারল্যান্ড প্লেস, ফেনিয়ান স্ট্রিট ডাবলিন 2, D02 AX07-এ রয়েছে৷ আয়ারল্যান্ড। "আমরা," "আমাদের," এবং "আমাদের" শব্দের অর্থ Twitter ইন্টারন্যাশনাল আনলিমিটেড কোম্পানি।

                    1. কে পরিষেবাগুলি ব্যবহার করতে পারে 2. গোপনীয়তা 3. পরিষেবাগুলির বিষয়বস্তু 4. পরিষেবাগুলি ব্যবহার করা 5. দায়বদ্ধতার সীমাবদ্ধতা 6. সাধারণ

                    1. কারা পরিষেবাগুলি ব্যবহার করতে পারে৷
                    আপনি শুধুমাত্র তখনই পরিষেবাগুলি ব্যবহার করতে পারেন যদি আপনি আমাদের সাথে একটি বাধ্যতামূলক চুক্তি তৈরি করতে সম্মত হন এবং প্রযোজ্য এখতিয়ারের আইনের অধীনে পরিষেবাগুলি পেতে বাধাপ্রাপ্ত ব্যক্তি নন৷ যে কোনো ক্ষেত্রে, পরিষেবাগুলি ব্যবহার করার জন্য আপনার বয়স কমপক্ষে 13 বছর হতে হবে৷ আপনি যদি এই শর্তাদি স্বীকার করেন এবং কোনও কোম্পানি, সংস্থা, সরকার বা অন্য আইনি সত্তার হয়ে পরিষেবাগুলি ব্যবহার করেন, তাহলে আপনি প্রতিনিধিত্ব করেন এবং ওয়ারেন্টি দেন যে আপনি এটি করার জন্য অনুমোদিত এবং এই শর্তাবলীতে এই ধরনের সত্তাকে আবদ্ধ করার ক্ষমতা আপনার আছে, যাতে এই শর্তাবলীতে ব্যবহৃত "আপনি" এবং "আপনার" শব্দগুলি এই ধরনের সত্তাকে নির্দেশ করবে।


                    2. গোপনীয়তা
                    আমাদের গোপনীয়তা নীতি (https://www.x.com/privacy) বর্ণনা করে যে আপনি যখন পরিষেবাগুলি ব্যবহার করেন তখন আপনার দেওয়া তথ্যগুলি আমরা কীভাবে পরিচালনা করি৷ আপনি বোঝেন যে আপনার পরিষেবাগুলির ব্যবহারের মাধ্যমে আপনি এই তথ্যের সংগ্রহ এবং ব্যবহারে সম্মতি দিচ্ছেন (গোপনীয়তা নীতিতে বর্ণিত), এই তথ্যটি মার্কিন যুক্তরাষ্ট্র, আয়ারল্যান্ড এবং/অথবা স্টোরেজের জন্য অন্যান্য দেশে স্থানান্তর সহ, প্রক্রিয়াকরণ এবং আমাদের এবং আমাদের সহযোগীদের দ্বারা ব্যবহার.


                    3. পরিষেবার বিষয়বস্তু
                    প্রযোজ্য আইন, বিধি এবং প্রবিধানের সাথে সম্মতি সহ আপনার পরিষেবাগুলির ব্যবহার এবং আপনার প্রদান করা যেকোনো সামগ্রীর জন্য আপনি দায়ী৷ আপনার শুধুমাত্র এমন সামগ্রী প্রদান করা উচিত যা আপনি অন্যদের সাথে ভাগ করতে স্বাচ্ছন্দ্যবোধ করেন৷

                    পরিষেবাগুলির মাধ্যমে পোস্ট করা বা পরিষেবাগুলির মাধ্যমে আপনার দ্বারা প্রাপ্ত কোনও সামগ্রী বা উপকরণের উপর কোনও ব্যবহার বা নির্ভরতা আপনার নিজের ঝুঁকিতে৷ আমরা পরিষেবাগুলির মাধ্যমে পোস্ট করা কোনও বিষয়বস্তু বা যোগাযোগের সম্পূর্ণতা, সত্যতা, নির্ভুলতা বা নির্ভরযোগ্যতার সমর্থন, সমর্থন, প্রতিনিধিত্ব বা গ্যারান্টি দিই না বা পরিষেবাগুলির মাধ্যমে প্রকাশিত কোনও মতামতকে সমর্থন করি না। আপনি বোঝেন যে পরিষেবাগুলি ব্যবহার করার মাধ্যমে, আপনি এমন সামগ্রীর সংস্পর্শে আসতে পারেন যা আপত্তিকর, ক্ষতিকারক, ভুল বা অন্যথায় অনুপযুক্ত হতে পারে, বা কিছু ক্ষেত্রে, পোস্টিং যা ভুল লেবেল করা হয়েছে বা অন্যথায় প্রতারণামূলক। সমস্ত বিষয়বস্তু এই ধরনের বিষয়বস্তু উদ্ভূত ব্যক্তির একমাত্র দায়িত্ব। আমরা পরিষেবাগুলির মাধ্যমে পোস্ট করা বিষয়বস্তু নিরীক্ষণ বা নিয়ন্ত্রণ করতে পারি না এবং আমরা এই ধরনের সামগ্রীর জন্য দায়িত্ব নিতে পারি না।

                    আমরা ব্যবহারকারী চুক্তি লঙ্ঘন করে এমন সামগ্রী অপসারণের অধিকার সংরক্ষণ করি, উদাহরণস্বরূপ, কপিরাইট বা ট্রেডমার্ক লঙ্ঘন বা অন্যান্য বৌদ্ধিক সম্পত্তি অপপ্রয়োগ, ছদ্মবেশ, বেআইনি আচরণ, বা হয়রানি সহ। সুনির্দিষ্ট নীতি সম্পর্কিত তথ্য এবং লঙ্ঘনের প্রতিবেদন বা আবেদন করার প্রক্রিয়া আমাদের সহায়তা কেন্দ্রে পাওয়া যাবে (https://help.x.com/rules-and-policies/x-report-violation এবং https://help.x. com/managing-your-account/suspended-x-accounts)।

                    আপনি যদি বিশ্বাস করেন যে আপনার সামগ্রী এমনভাবে অনুলিপি করা হয়েছে যা কপিরাইট লঙ্ঘন গঠন করে, অনুগ্রহ করে আমাদের কপিরাইট রিপোর্টিং ফর্ম (https://help.x.com/forms/dmca) পরিদর্শন করে বা এখানে আমাদের মনোনীত কপিরাইট এজেন্টের সাথে যোগাযোগ করে রিপোর্ট করুন:

                    এক্স কর্পোরেশন
                    Attn: কপিরাইট এজেন্ট
                    1355 মার্কেট স্ট্রিট, স্যুট 900
                    সান ফ্রান্সিসকো, CA 94103
                    প্রতিবেদন: https://help.x.com/forms/dmca
                    ইমেইল: copyright@x.com

                    বিষয়বস্তুতে আপনার অধিকার এবং অধিকার প্রদান
                    পরিষেবাগুলিতে বা এর মাধ্যমে আপনি যে কোনও সামগ্রী জমা দেন, পোস্ট করেন বা প্রদর্শন করেন তার উপর আপনি আপনার অধিকার বজায় রাখেন। আপনার যা আপনার তা আপনারই — আপনি আপনার সামগ্রীর মালিক (এবং আপনার অন্তর্ভুক্ত অডিও, ফটো এবং ভিডিওগুলি সামগ্রীর অংশ হিসাবে বিবেচিত হয়)৷

                    পরিষেবাগুলিতে বা এর মাধ্যমে সামগ্রী জমা দেওয়ার, পোস্ট করার বা প্রদর্শন করার মাধ্যমে, আপনি আমাদের ব্যবহার, অনুলিপি, পুনরুত্পাদন, প্রক্রিয়া, অভিযোজন, পরিবর্তন, প্রকাশ, প্রেরণের জন্য একটি বিশ্বব্যাপী, অ-এক্সক্লুসিভ, রয়্যালটি-মুক্ত লাইসেন্স (সাবলাইসেন্সের অধিকার সহ) প্রদান করেন। , এখন পরিচিত বা পরে বিকশিত যে কোনো এবং সমস্ত মিডিয়া বা বিতরণ পদ্ধতিতে এই ধরনের সামগ্রী প্রদর্শন এবং বিতরণ করুন (স্বচ্ছতার জন্য, এই অধিকারগুলি অন্তর্ভুক্ত, উদাহরণস্বরূপ, কিউরেটিং, রূপান্তর এবং অনুবাদ)।

                </h2>
                <h2>এই লাইসেন্সটি আমাদেরকে আপনার বিষয়বস্তু বিশ্বের বাকি অংশে উপলব্ধ করতে এবং অন্যদেরও একই কাজ করতে দেওয়ার অনুমতি দেয়৷ যাইহোক, আপনি যদি একটি সীমাবদ্ধ সম্প্রদায়ের মধ্যে আপনার সামগ্রীর বিতরণ সীমাবদ্ধ করতে আমাদের বৈশিষ্ট্যগুলির মাধ্যমে বেছে নিয়ে থাকেন তবে আমরা সেই পছন্দটিকে সম্মান করব। আপনি এও সম্মত হন যে এই লাইসেন্সটিতে পরিষেবাগুলিকে উন্নত করার জন্য আপনার দেওয়া পাঠ্য এবং অন্যান্য তথ্য বিশ্লেষণ করার অধিকার অন্তর্ভুক্ত রয়েছে। আপনি সম্মত হন যে এই লাইসেন্সের মধ্যে আমাদের পরিষেবাগুলি প্রদান, প্রচার এবং উন্নত করার অধিকার অন্তর্ভুক্ত রয়েছে এবং সিন্ডিকেশন, সম্প্রচার, বিতরণ, পুনঃপোস্ট, প্রচার বা প্রকাশনার জন্য অন্যান্য কোম্পানি, সংস্থা বা ব্যক্তিদের কাছে উপলব্ধ পরিষেবাগুলিতে বা এর মাধ্যমে জমা দেওয়া সামগ্রী তৈরি করার অধিকার রয়েছে৷ অন্যান্য মিডিয়া এবং পরিষেবাগুলিতে এই ধরনের বিষয়বস্তুর, এই ধরনের সামগ্রী ব্যবহারের জন্য আমাদের শর্তাবলী সাপেক্ষে। আমাদের, বা অন্যান্য কোম্পানি, সংস্থা বা ব্যক্তিদের দ্বারা এই ধরনের অতিরিক্ত ব্যবহারগুলি, আপনি যে সামগ্রী জমা দেন, পোস্ট করেন, প্রেরণ করেন বা অন্যথায় পরিষেবাগুলির মাধ্যমে উপলব্ধ করেন সেই বিষয়বস্তুর ক্ষেত্রে আপনাকে কোনও ক্ষতিপূরণ প্রদান না করেই করা হয় কারণ আপনার দ্বারা পরিষেবাগুলি ব্যবহার করা হয়৷ এতদ্বারা বিষয়বস্তু এবং এখানে অধিকার প্রদানের জন্য যথেষ্ট ক্ষতিপূরণ হিসাবে সম্মত।

                    বাস্তুতন্ত্রের অংশীদাররা কীভাবে পরিষেবাগুলিতে আপনার সামগ্রীর সাথে ইন্টারঅ্যাক্ট করতে পারে তার জন্য আমাদের কাছে একটি বিবর্তিত নিয়ম রয়েছে৷ এই নিয়মগুলি আপনার অধিকারকে মাথায় রেখে একটি উন্মুক্ত বাস্তুতন্ত্রকে সক্ষম করার জন্য বিদ্যমান। আপনি বোঝেন যে আমরা আপনার বিষয়বস্তু পরিবর্তন বা মানিয়ে নিতে পারি কারণ এটি আমাদের এবং আমাদের অংশীদারদের দ্বারা বিতরণ করা, সিন্ডিকেট করা, প্রকাশিত বা সম্প্রচার করা হয় এবং/অথবা বিভিন্ন মিডিয়াতে বিষয়বস্তুকে মানিয়ে নেওয়ার জন্য আপনার সামগ্রীতে পরিবর্তন করতে পারি৷

                    আপনি প্রতিনিধিত্ব করেন এবং পরোয়ানা করেন যে আপনার কাছে বা পরিষেবাগুলিতে বা এর মাধ্যমে জমা দেওয়া, পোস্ট করা বা প্রদর্শন করা যে কোনও সামগ্রীর জন্য এখানে প্রদত্ত অধিকারগুলি প্রদানের জন্য প্রয়োজনীয় সমস্ত অধিকার, লাইসেন্স, সম্মতি, অনুমতি, ক্ষমতা এবং/অথবা আপনার কাছে রয়েছে বা প্রাপ্ত হয়েছে৷ আপনি সম্মত হন যে এই ধরনের সামগ্রীতে কপিরাইট বা অন্যান্য মালিকানার অধিকারের বিষয়বস্তু থাকবে না, যদি না আপনার প্রয়োজনীয় অনুমতি থাকে বা অন্যথায় উপাদানটি পোস্ট করার এবং আমাদের উপরে বর্ণিত লাইসেন্স দেওয়ার আইনত অধিকার না থাকে।


                    4. পরিষেবাগুলি ব্যবহার করা৷
                    দয়া করে আমাদের নিয়ম ও নীতিগুলি পর্যালোচনা করুন, যা ব্যবহারকারী চুক্তির অংশ এবং পরিষেবাগুলিতে নিষিদ্ধ আচরণের রূপরেখা। আপনি শুধুমাত্র এই শর্তাবলী এবং সমস্ত প্রযোজ্য আইন, নিয়ম এবং প্রবিধান মেনে পরিষেবাগুলি ব্যবহার করতে পারেন৷ X যখন বিষয়বস্তু বা ব্যবহারকারীর আচরণ আমাদের নিয়ম ও নীতি লঙ্ঘন করে বা সংবেদনশীল মিডিয়ার সাথে সম্পর্কিত হয় তখন প্রয়োগকারী পদক্ষেপ নেয়। আপনি X এর প্রয়োগের বিকল্পগুলি পর্যালোচনা করতে পারেন এবং কীভাবে আপনি এখানে আমাদের প্রয়োগকারী সিদ্ধান্তের আবেদন করতে পারেন।

                    পরিষেবাগুলি ক্রমাগত বিকশিত হয়। যেমন, পরিষেবাগুলি সময়ে সময়ে, আমাদের বিবেচনার ভিত্তিতে পরিবর্তিত হতে পারে৷ আমরা (স্থায়ীভাবে বা অস্থায়ীভাবে) পরিষেবাগুলি বা পরিষেবাগুলির মধ্যে যে কোনও বৈশিষ্ট্য আপনাকে বা সাধারণভাবে ব্যবহারকারীদের দেওয়া বন্ধ করতে পারি। আমরা যে কোনো সময় আমাদের নিজস্ব বিবেচনার ভিত্তিতে ব্যবহার এবং সঞ্চয়স্থানের সীমা তৈরি করার অধিকারও ধরে রাখি। আমরা পরিষেবাগুলিতে কোনও সামগ্রী বিতরণ করতে বা প্রত্যাখ্যান করতে পারি, পরিষেবার কোনও সামগ্রীর বিতরণ বা দৃশ্যমানতা সীমিত করতে পারি, ব্যবহারকারীদের স্থগিত বা বন্ধ করতে পারি এবং উপযুক্ত হলে ব্যবহারকারীর নাম পুনরুদ্ধার করতে পারি, নিম্নলিখিত কারণগুলি সহ: (i) পরিষেবাগুলিকে সুরক্ষা দেওয়া অথবা আমাদের ব্যবহারকারীদের; (ii) উপযুক্ত কর্তৃপক্ষের প্রযোজ্য আইন বা আদেশের সাথে সম্মতি; (iii) এই শর্তাবলী বা আমাদের নিয়ম এবং নীতি বা তৃতীয় পক্ষের মেধা সম্পত্তি বা অন্যান্য অধিকার লঙ্ঘন; (iv) যদি আপনি বা আপনার বিষয়বস্তু আমাদের, অন্যান্য ব্যবহারকারী বা কোনো তৃতীয় পক্ষকে আইনি বা নিয়ন্ত্রক ঝুঁকির সম্মুখীন করে; এবং/অথবা (v) আপনার দীর্ঘায়িত নিষ্ক্রিয়তা।
                    আমাদের আপনাকে পরিষেবাগুলিতে অ্যাক্সেস এবং ব্যবহার করার বিষয়ে বিবেচনা করে, আপনি সম্মত হন যে আমরা এবং আমাদের তৃতীয়-পক্ষ প্রদানকারী এবং অংশীদাররা পরিষেবাগুলিতে বিজ্ঞাপন দিতে পারি বা পরিষেবাগুলি থেকে সামগ্রী বা তথ্য প্রদর্শনের সাথে সম্পর্কিত যে আপনি জমা দিয়েছেন বা অন্যান্য. আমরা যেকোন তথ্য অ্যাক্সেস, পড়ার, সংরক্ষণ এবং প্রকাশ করার অধিকারও সংরক্ষণ করি কারণ আমরা যুক্তিসঙ্গতভাবে বিশ্বাস করি যে (i) কোনো প্রযোজ্য আইন, প্রবিধান, আইনি প্রক্রিয়া বা সরকারী অনুরোধ সন্তুষ্ট করতে, (ii) সম্ভাব্য তদন্ত সহ শর্তাদি প্রয়োগ করা এর লঙ্ঘন, (iii) জালিয়াতি, নিরাপত্তা বা প্রযুক্তিগত সমস্যাগুলি সনাক্ত করা, প্রতিরোধ করা বা অন্যথায় মোকাবেলা করা, (iv) ব্যবহারকারীর সহায়তার অনুরোধে সাড়া দেওয়া, বা (v) X, এর ব্যবহারকারীদের এবং জনসাধারণের অধিকার, সম্পত্তি বা নিরাপত্তা রক্ষা করা। আমরা আমাদের গোপনীয়তা নীতি ব্যতীত তৃতীয় পক্ষের কাছে ব্যক্তিগতভাবে সনাক্তকারী তথ্য প্রকাশ করি না।
                    X-এ কিছু পরিষেবা বা বৈশিষ্ট্য অফার করা হতে পারে যার জন্য আপনার সেই পরিষেবাগুলির ব্যবহারের সাথে সম্পর্কিত অতিরিক্ত শর্তাবলী প্রযোজ্য হতে পারে। এই অতিরিক্ত শর্তাবলী আমাদের সাইট এবং এই পরিষেবা বা বৈশিষ্ট্যগুলির জন্য নিবেদিত অ্যাপ্লিকেশনগুলি থেকে অ্যাক্সেসযোগ্য৷ এই অতিরিক্ত পরিষেবাগুলির যে কোনও একটি ব্যবহার করে বা অর্থপ্রদান করার মাধ্যমে, আপনাকে সেই পরিষেবাগুলির জন্য প্রযোজ্য যে কোনও অতিরিক্ত শর্তাবলীতে সম্মত হতে হবে এবং সেই অতিরিক্ত শর্তগুলিও আপনার সাথে আমাদের চুক্তির অংশ হয়ে উঠবে৷ প্রযোজ্য অতিরিক্ত শর্তাবলীর যেকোনও যদি এই শর্তাবলীর সাথে সাংঘর্ষিক হয়, তাহলে অতিরিক্ত শর্তাবলী প্রাধান্য পাবে যখন আপনি সেই পরিষেবাগুলি ব্যবহার করছেন যেখানে তারা প্রযোজ্য হবে।

                    আপনি যদি পরিষেবাগুলির অর্থপ্রদানের বৈশিষ্ট্যগুলি ব্যবহার করেন, আপনি প্রদত্ত পরিষেবাগুলির জন্য প্রযোজ্য শর্তাবলীতে সম্মত হন (https://legal.x.com/purchaser-terms.html)৷

                    আপনি যদি পরিষেবাগুলির বিকাশকারী বৈশিষ্ট্যগুলি ব্যবহার করেন, যার মধ্যে রয়েছে কিন্তু সীমাবদ্ধ নয় X for Websites (https://developer.x.com/docs/twitter-for-websites), X কার্ডগুলি (https://developer.x.com/ docs/twitter-for-websites/cards/overview/abouts-cards), পাবলিক API (https://developer.x.com/docs), অথবা X (https://developer.x.com/docs) দিয়ে সাইন ইন করুন /authentication/guides/log-in-with-twitter), আপনি আমাদের বিকাশকারী চুক্তি (https://developer.x.com/developer-terms/agreement) এবং বিকাশকারী নীতিতে সম্মত হন (https://developer.x.com) /বিকাশকারী শর্তাবলী/নীতি)। আপনি যদি পুনরুত্পাদন, পরিবর্তন, ডেরিভেটিভ কাজ তৈরি করতে, বিতরণ, বিক্রয়, স্থানান্তর, সর্বজনীনভাবে প্রদর্শন, সর্বজনীনভাবে সঞ্চালন, প্রেরণ, বা অন্যথায় পরিষেবাগুলিতে পরিষেবা বা বিষয়বস্তু ব্যবহার করতে চান, তাহলে আপনাকে অনুমতি ছাড়া আমাদের দেওয়া ইন্টারফেস এবং নির্দেশাবলী ব্যবহার করতে হবে পরিষেবা, এই শর্তাবলী বা https://developer.x.com/developer-terms-এ প্রদত্ত শর্তাবলীর মাধ্যমে। অন্যথায়, এই ধরনের সমস্ত কর্ম কঠোরভাবে নিষিদ্ধ করা হয়. আপনি যদি একজন নিরাপত্তা গবেষক হন, তাহলে আপনাকে আমাদের দুর্বলতা রিপোর্টিং প্রোগ্রামের (https://hackerone.com/x) নিয়ম মেনে চলতে হবে। পূর্ববর্তী অনুচ্ছেদে নির্ধারিত প্রয়োজনীয়তাগুলি আমাদের দুর্বলতা রিপোর্টিং প্রোগ্রামে অংশগ্রহণকারীদের জন্য প্রযোজ্য নাও হতে পারে।

                    আপনি যদি পরিষেবাগুলির বিজ্ঞাপন বৈশিষ্ট্যগুলি ব্যবহার করেন তবে আপনি আমাদের মাস্টার পরিষেবা চুক্তিতে সম্মত হন (https://ads.x.com/terms)৷

                    আপনার অ্যাকাউন্ট
                    পরিষেবাগুলি ব্যবহার করার জন্য আপনাকে একটি অ্যাকাউন্ট তৈরি করতে হতে পারে৷ আপনি আপনার অ্যাকাউন্ট সুরক্ষিত করার জন্য দায়ী, তাই একটি শক্তিশালী পাসওয়ার্ড ব্যবহার করুন এবং এই অ্যাকাউন্টে এর ব্যবহার সীমিত করুন। আমরা উপরোক্ত মেনে চলতে আপনার ব্যর্থতা থেকে উদ্ভূত কোনো ক্ষতি বা ক্ষতির জন্য দায়ী হতে পারি না এবং হবে না।

                    আপনি পরিষেবাগুলি থেকে বেশিরভাগ যোগাযোগ নিয়ন্ত্রণ করতে পারেন৷ আমাদের আপনাকে কিছু নির্দিষ্ট যোগাযোগ প্রদান করতে হতে পারে, যেমন পরিষেবার ঘোষণা এবং প্রশাসনিক বার্তা। এই যোগাযোগগুলি পরিষেবা এবং আপনার অ্যাকাউন্টের অংশ হিসাবে বিবেচিত হয় এবং আপনি সেগুলি গ্রহণ করা থেকে অপ্ট-আউট করতে সক্ষম নাও হতে পারেন৷ আপনি যদি আপনার অ্যাকাউন্টে আপনার ফোন নম্বর যোগ করেন এবং আপনি পরে সেই ফোন নম্বরটি পরিবর্তন বা নিষ্ক্রিয় করেন, তাহলে আপনাকে অবশ্যই আপনার অ্যাকাউন্টের তথ্য আপডেট করতে হবে যাতে আমরা আপনার পুরানো নম্বরটি অর্জন করে এমন কারও সাথে যোগাযোগ করতে না পারা।

                    পরিষেবাগুলি ব্যবহার করার জন্য আপনার লাইসেন্স৷
                    পরিষেবার অংশ হিসাবে আপনাকে প্রদত্ত সফ্টওয়্যার ব্যবহার করার জন্য আমরা আপনাকে একটি ব্যক্তিগত, বিশ্বব্যাপী, রয়্যালটি-মুক্ত, অ-অর্পণযোগ্য এবং নন-এক্সক্লুসিভ লাইসেন্স দিই। এই শর্তাবলী দ্বারা অনুমোদিত পদ্ধতিতে, X এ প্রদত্ত পরিষেবাগুলির সুবিধাগুলি ব্যবহার করতে এবং উপভোগ করতে আপনাকে সক্ষম করা এই লাইসেন্সের একমাত্র উদ্দেশ্য।

                    পরিষেবাগুলি কপিরাইট, ট্রেডমার্ক, এবং মার্কিন যুক্তরাষ্ট্র এবং অন্যান্য দেশের অন্যান্য আইন দ্বারা সুরক্ষিত। শর্তাবলীর কোন কিছুই আপনাকে X নাম বা X ট্রেডমার্ক, লোগো, ডোমেন নাম, অন্যান্য স্বতন্ত্র ব্র্যান্ড বৈশিষ্ট্য এবং অন্যান্য মালিকানা অধিকার ব্যবহার করার অধিকার দেয় না। সমস্ত অধিকার, শিরোনাম, এবং পরিষেবাগুলিতে এবং আগ্রহ (ব্যবহারকারীদের দ্বারা প্রদত্ত বিষয়বস্তু ব্যতীত) আমাদের এবং আমাদের লাইসেন্সকারীদের একচেটিয়া সম্পত্তি এবং থাকবে। X, বা পরিষেবাগুলি সম্পর্কে আপনি যে কোনও প্রতিক্রিয়া, মন্তব্য বা পরামর্শ প্রদান করতে পারেন তা সম্পূর্ণরূপে স্বেচ্ছাসেবী এবং আমরা এই ধরনের প্রতিক্রিয়া, মন্তব্য বা পরামর্শগুলি ব্যবহার করতে মুক্ত থাকব যা আমরা উপযুক্ত মনে করি এবং আপনার প্রতি কোনও বাধ্যবাধকতা ছাড়াই৷

                    পরিষেবার অপব্যবহার
                    আপনি পরিষেবাগুলির অপব্যবহার না করার বিষয়েও সম্মত হন, উদাহরণস্বরূপ, তাদের সাথে হস্তক্ষেপ করে বা ইন্টারফেস এবং আমাদের দেওয়া নির্দেশাবলী ছাড়া অন্য কোনও পদ্ধতি ব্যবহার করে সেগুলি অ্যাক্সেস করে৷ আপনি সম্মত হন যে আপনি পরিষেবার অংশ হিসাবে আপনাকে প্রদত্ত সফ্টওয়্যারটিতে কোনও প্রযুক্তিগত সীমাবদ্ধতা নিয়ে কাজ করবেন না, বা প্রযোজ্য আইন স্পষ্টভাবে অনুমতি দেয় এমন সীমা ছাড়া, সফ্টওয়্যারটিকে বিপরীত প্রকৌশলী, ডিকম্পাইল বা বিচ্ছিন্ন করবেন না। পরিষেবাগুলি অ্যাক্সেস বা ব্যবহার করার সময় আপনি নিম্নলিখিতগুলির কোনওটি নাও করতে পারেন: (i) পরিষেবাগুলির অ-পাবলিক অঞ্চলগুলি, আমাদের কম্পিউটার সিস্টেমগুলি, বা আমাদের প্রদানকারীদের প্রযুক্তিগত বিতরণ সিস্টেমগুলি অ্যাক্সেস করা, এর সাথে হস্তক্ষেপ করা বা ব্যবহার করা; (ii) কোনো সিস্টেম বা নেটওয়ার্কের দুর্বলতা যাচাই, স্ক্যান বা পরীক্ষা করা বা কোনো নিরাপত্তা বা প্রমাণীকরণ ব্যবস্থা লঙ্ঘন বা বাধা দেওয়া;
                    (iii) আমাদের বর্তমানে উপলব্ধ, প্রকাশিত ইন্টারফেস যা আমাদের দ্বারা প্রদত্ত (এবং শুধুমাত্র প্রযোজ্য শর্তাবলী অনুসারে) ব্যতীত অন্য যেকোন উপায়ে (স্বয়ংক্রিয় বা অন্যথায়) পরিষেবাগুলি অ্যাক্সেস বা অনুসন্ধান বা অ্যাক্সেস বা অনুসন্ধান করার চেষ্টা করুন, যদি না আপনি আমাদের সাথে একটি পৃথক চুক্তিতে বিশেষভাবে এটি করার অনুমতি দেওয়া হয়েছে (দ্রষ্টব্য: আমাদের পূর্ব লিখিত সম্মতি ব্যতীত যেকোনো উদ্দেশ্যে পরিষেবাগুলিকে ক্রল করা বা স্ক্র্যাপ করা স্পষ্টভাবে নিষিদ্ধ); (iv) কোনো ইমেল বা পোস্টিং-এ কোনো TCP/IP প্যাকেট হেডার বা হেডার তথ্যের কোনো অংশ জাল করা, অথবা পরিবর্তিত, প্রতারণামূলক বা মিথ্যা উৎস-শনাক্তকারী তথ্য পাঠাতে পরিষেবাগুলি ব্যবহার করা; (v) আমাদের প্ল্যাটফর্ম ম্যানিপুলেশন এবং স্প্যাম নীতি বা অন্য কোনো নিয়ম ও নীতি লঙ্ঘন করে এমন কোনো আচরণে জড়িত হওয়া; বা (vi) কোনো ব্যবহারকারী, হোস্ট বা নেটওয়ার্কের অ্যাক্সেসে হস্তক্ষেপ বা ব্যাঘাত ঘটানো, (বা করার চেষ্টা), সীমাবদ্ধতা ছাড়াই, ভাইরাস পাঠানো, ওভারলোডিং, বন্যা, স্প্যামিং, মেল-বোমািং পরিষেবা, বা এমনভাবে বিষয়বস্তু তৈরির স্ক্রিপ্ট করে যাতে হস্তক্ষেপ করা হয় বা পরিষেবার উপর অযথা বোঝা তৈরি হয়। এই শর্তাবলী লঙ্ঘন করতে অন্যদের সুবিধা দেওয়া বা সহায়তা করাও এই শর্তাবলীর লঙ্ঘন, যার মধ্যে পণ্য বা পরিষেবাগুলি বিতরণ করা যা এই শর্তাবলী লঙ্ঘনকে সক্ষম বা উত্সাহিত করে৷

                    এই শর্তাদি শেষ করা হচ্ছে
                    আপনি আপনার অ্যাকাউন্টগুলি নিষ্ক্রিয় করে এবং পরিষেবাগুলির আপনার ব্যবহার বন্ধ করে যে কোনও সময় আমাদের সাথে আপনার আইনি চুক্তি শেষ করতে পারেন৷ কীভাবে আপনার অ্যাকাউন্ট নিষ্ক্রিয় করতে হয় তার নির্দেশাবলীর জন্য https://help.x.com/managing-your-account/how-to-deactivate-x-account দেখুন এবং আপনার তথ্যের কী হবে সে সম্পর্কে আরও তথ্যের জন্য গোপনীয়তা নীতি দেখুন৷

                    আমরা আপনার অ্যাকাউন্ট স্থগিত বা সমাপ্ত করতে পারি বা যেকোনো সময় আপনাকে পরিষেবার সমস্ত বা অংশ সরবরাহ করা বন্ধ করে দিতে পারি যদি আমরা যুক্তিসঙ্গতভাবে বিশ্বাস করি: (i) আপনি এই শর্তাবলী বা আমাদের নিয়ম ও নীতি লঙ্ঘন করেছেন; (ii) আপনি আমাদের জন্য ঝুঁকি বা সম্ভাব্য আইনি এক্সপোজার তৈরি করেন; (iii) বেআইনি আচরণের কারণে আপনার অ্যাকাউন্ট মুছে ফেলা উচিত; (iv) দীর্ঘস্থায়ী নিষ্ক্রিয়তার কারণে আপনার অ্যাকাউন্ট সরানো উচিত; অথবা (v) আপনার জন্য আমাদের পরিষেবার বিধান আর বাণিজ্যিকভাবে কার্যকর নয়৷ পরিস্থিতির উপর নির্ভর করে আমরা আপনার অ্যাকাউন্টের সাথে যুক্ত ইমেল ঠিকানার মাধ্যমে বা পরবর্তী সময়ে যখন আপনি আপনার অ্যাকাউন্ট অ্যাক্সেস করার চেষ্টা করবেন তখন আপনাকে জানানোর যুক্তিসঙ্গত প্রচেষ্টা করব। এই ধরনের সমস্ত ক্ষেত্রে, শর্তাদি শেষ হয়ে যাবে, যার মধ্যে সীমাবদ্ধতা ছাড়াই, আপনার পরিষেবাগুলি ব্যবহার করার লাইসেন্স, ব্যতীত নিম্নলিখিত বিভাগগুলি প্রযোজ্য হবে: 2, 3, 5, 6, এবং ধারা 4 এর অপব্যবহারের বিধান ("অপব্যবহার পরিষেবাগুলির")। আপনি যদি বিশ্বাস করেন যে আপনার অ্যাকাউন্টটি ভুলবশত বন্ধ হয়ে গেছে আপনি আমাদের সহায়তা কেন্দ্রে (https://help.x.com/forms/account-access/appeals) পাওয়া পদক্ষেপগুলি অনুসরণ করে একটি আপিল দায়ের করতে পারেন৷ সন্দেহ এড়ানোর জন্য, এই শর্তাবলী আপনার অ্যাকাউন্ট নিষ্ক্রিয় বা সমাপ্তি থেকে বেঁচে থাকে।


                    5. দায়বদ্ধতার সীমাবদ্ধতা
                    পরিষেবাগুলি ব্যবহার করে আপনি সম্মত হন যে X Corp., এর পিতামাতা, সহযোগী, সংশ্লিষ্ট কোম্পানি, কর্মকর্তা, পরিচালক, কর্মচারী, এজেন্ট প্রতিনিধি, অংশীদার এবং লাইসেন্সদাতাদের দায়বদ্ধতা আপনার বসবাসের দেশে অনুমোদিত সর্বাধিক পরিমাণে সীমাবদ্ধ।


                    6. সাধারণ
                    আমরা সময়ে সময়ে এই শর্তাদি সংশোধন করতে পারি। পরিবর্তনগুলি পূর্ববর্তী হবে না, এবং শর্তাবলীর সবচেয়ে বর্তমান সংস্করণ, যা সর্বদা x.com/tos এ থাকবে, আপনার সাথে আমাদের সম্পর্ক পরিচালনা করবে৷ নতুন ফাংশন সম্বোধন বা আইনি কারণে করা পরিবর্তনগুলি ব্যতীত, আমরা আপনাকে এই শর্তাবলীতে কার্যকরী পরিবর্তন করার 30 দিন আগে অবহিত করব যা এই শর্তাবলীতে যেকোনো পক্ষের অধিকার বা বাধ্যবাধকতাকে প্রভাবিত করে, উদাহরণস্বরূপ একটি পরিষেবা বিজ্ঞপ্তি বা একটি ইমেলের মাধ্যমে আপনার অ্যাকাউন্টের সাথে যুক্ত ইমেইলে। এই সংশোধনগুলি কার্যকর হওয়ার পরে পরিষেবাগুলি অ্যাক্সেস করা বা ব্যবহার করা চালিয়ে যাওয়ার মাধ্যমে, আপনি সংশোধিত শর্তাবলী দ্বারা আবদ্ধ হতে সম্মত হন৷

                    আইন দ্বারা অনুমোদিত সীমা পর্যন্ত, আপনি বাদী বা শ্রেণী সদস্য হিসাবে যেকোন কথিত শ্রেণী কর্ম, সম্মিলিত ক্রিয়া বা প্রতিনিধিত্বমূলক পদক্ষেপে অংশগ্রহণের অধিকার পরিত্যাগ করেন।

                    X ব্যবহারকারী চুক্তিটি ইংরেজিতে লেখা কিন্তু অনুবাদের মাধ্যমে একাধিক ভাষায় উপলব্ধ করা হয়েছে। X মূল ইংরেজি সংস্করণে অনুবাদগুলো যথাসম্ভব নির্ভুল করার চেষ্টা করে। যাইহোক, কোনো অসঙ্গতি বা অসঙ্গতির ক্ষেত্রে, X ব্যবহারকারী চুক্তির ইংরেজি ভাষার সংস্করণ অগ্রাধিকার পাবে। আপনি স্বীকার করেন যে X ব্যবহারকারী চুক্তির শর্তাবলী ব্যাখ্যা এবং নির্মাণের জন্য ইংরেজি হবে রেফারেন্সের ভাষা।

                    ইভেন্টে যে এই শর্তাবলীর কোনো বিধান অবৈধ বা অপ্রয়োগযোগ্য বলে ধরে নেওয়া হয়, তাহলে সেই বিধানটি প্রয়োজনীয় ন্যূনতম পরিমাণে সীমিত বা বাদ দেওয়া হবে এবং এই শর্তাবলীর অবশিষ্ট বিধানগুলি পূর্ণ বল এবং কার্যকর থাকবে৷ এই শর্তাবলীর কোনো অধিকার বা বিধান কার্যকর করতে আমাদের ব্যর্থতা এই ধরনের অধিকার বা বিধানের মওকুফ বলে গণ্য হবে না।

                    এই শর্তাবলী সম্পর্কে আপনার কোন প্রশ্ন থাকলে, আমাদের সাথে যোগাযোগ করুন.

                    কার্যকরী: সেপ্টেম্বর 29, 2023

                    পূর্ববর্তী শর্তাবলী সংরক্ষণাগার
                </h2>
-->

            </div>
        </div>
    </div>
</body>

</html>
